package com.jks.amal.CancerOthers;

import android.os.Bundle;

import androidx.appcompat.app.ActionBar;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.jks.amal.R;

import java.util.ArrayList;

public class Prevention extends AppCompatActivity {

    RvAdapterOthers mAdapter;
    RecyclerView recyclerView;
    ArrayList<ItemsOthers> mItems;
    RecyclerView.LayoutManager mlayoutManager;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.prevention);

        recyclerView = findViewById(R.id.recyclerView_others);

        mItems = new ArrayList<>();
        mItems.add(new ItemsOthers("عدم التدخين\n"
                ,"تحتوي السجائر على أكثر من 60 مادة كيماوية مسرطنة، والتدخين هو المسبب الرئيسي ل 16 نوع سرطان منها: الرئة والقولون والفم، والحنجرة وعنق الرحم والبنكرياس والمعدة."
                ,R.drawable.no_smoking));
        mItems.add(new ItemsOthers("الغذاء الصحي\n","تناول وجبات صحية، وابتعد عن الوجبات السريعة غير الصحية وقلّل من تناول الدهون واللحوم الحمراء، وتجنّب المشروبات الكحولية.\n" +
                "\n" +
                " \n" +
                "\n" +
                "الأغذية التي يُنصح بها:\n" +
                "الفاكهة والخضراوات: تعد مصدرا للفيتامينات والمعادن والألياف، وتقلّل من فرصة الإصابة بسرطان البلعوم، والحنجرة، والرئة، والمريء، والمعدة، وعنق الرحم، والقولون، والمستقيم.\n" +
                "الحبوب الكاملة: يفضّل التقليل من تناول الكربوهيدرات المكررة مثل: الخبز الأبيض، والأرز، والمعكرونة، واستبدالها بالحبوب الكاملة مثل: الأرز البني، والبرغل، والفريكة، والكينوا، والشعير، والشوفان، التي تساهم في التّقليل من خطر الإصابة ببعض أنواع السرطان مثل سرطان القولون.\n" +
                "البهارات: تحتوي البهارات مثل الكركم، والقرفة، والكزبرة، والشومر على مواد تساعد على مقاومة الخلايا السرطانية.\n" +
                "السمك: يحتوي السمك مثل السلمون على حامض أوميغا-3 الدهني المقاوم للسرطان، كما أنه يعد مصدرا غنيا للبروتين. لذا حاول تناول السمك مرة واحدة في الأسبوع على الأقل.\n" +
                "الأغذية التي عليك تجنّبها:\n" +
                "\n" +
                "الأطعمة المالحة والمحفوظة بالملح: إن تناول كميات كبيرة منها، يمكن أن يزيد من خطر الإصابة بسرطان المعدة والقولون.\n" +
                "اللحوم الحمراء: تناول كميات كبيرة من اللحوم الحمراء (أكثر من 80 غرام يوميا) مثل لحم البقر والضأن (الخروف)، يزيد من خطر الإصابة بسرطان القولون.\n" +
                "الأطعمة المصنّعة: عادة ما تحتوي الأطعمة المصنّعة على الدهون المشبعة، والدهون غير المشبعة، والإضافات الغذائية، ومواد حافظة ومحسنة للطعم واللون، حاول الابتعاد عن هذه الأطعمة مثل: رقائق البطاطس، والبسكويت، واللحوم المصنعة مثل النقانق."
                ,R.drawable.harvest));
        mItems.add(new ItemsOthers("ممارسة الرياضة\n","الرياضة تساهم في المحافظة على وزن صحي، ويقلل من خطر الإصابة ببعض أنواع السرطان مثل سرطان المريء، والبنكرياس، والقولون، والثدي، والرحم، والكلية، والغدة الدرقية، والكبد، والمرارة.\n" +
                "\n" +
                " \n" +
                "\n" +
                "ممارسة التمارين الرياضية تزيد من مناعة الجسم، وتحافظ على وزن صحي ممّا يساعدنا على التقليل من خطر الإصابة بالعديد من أنواع السرطان."
                ,R.drawable.running));
        mItems.add(new ItemsOthers("حماية الجلد\n","إنّ التعرّض للأشعّة فوق البنفسجيّة الصّادرة عن أشعّة الشمس سبب رئيسي للإصابة بسرطان الجلد، ومسؤول عن 80-90% من هذه الإصابات.\n" +
                "\n" +
                " \n" +
                "\n" +
                "تجنّب السلوكيات التالية: التعرض المتعمّد لأشّعة الشمس لفترة طويلة، خاصة بين الساعة 12 ظهرا والساعة 4 عصرا، عندما تكون أشعة الشمس أقوى ما تكون.\n" +
                "استخدام تقنية التّسمير الداخلية، حيث أنّ الأشعة فوق البنفسجية الصناعية مؤذية كأشعّة الشمس.\n" +
                "احرص على:\n" +
                "\n" +
                "فحص الشّامات على جسمك من وقت لآخر، لملاحظة أي تغيّر في شكلها أو ملمسها. إذا لاحظت أي تغيّر، قم بحجز موعد لدى أخصائي جلدية.\n" +
                "ارتداء النظارات الشمسية والقبعة (لحماية عينيك من الأشعة فوق البنفسجية).\n" +
                "ضع واقي الشمس كلّ يوم، ليس فقط عند الذهاب إلى السباحة."
                ,R.drawable.sun_protection));
        mItems.add(new ItemsOthers("مطعوم فايروس الورم الحليمي\n"
                ,"هناك أنواع سرطانات ناتجة عن الإصابة بعدوى، ويمكنك حماية نفسك من العدوى بأخذ المطعوم المخصّص للمرض.\n" +
                "\n" +
                " \n" +
                "\n" +
                "سرطان الكبد مرتبط ارتباطا وثيقا بالتهاب الكبد الوبائي نوع \"ب\":\n" +
                "يتم نقل هذه العدوى من خلال الاتصال الجنسي، أو التعرض لدم مصاب، أو من الأم لجنينها خلال فترة الحمل أو الولادة.\n" +
                "يمكن أن يقي مطعوم التهاب الكبد الوبائي \"ب\"خلال فترة الطفولة من 95% من الإصابات بالتهاب الكبد الوبائي \"ب\" عند الكبار، والوقاية من الإصابة بسرطان الكبد في أغلب الحالات.\n" +
                "يتم إعطاء مطعوم التهاب الكبد الوبائي \"ب\"عن طريق حقن عضلية. ويتطلب إعطاء ثلاث جرعات من المطعوم، كما يمكن للشخص أخذ المطعوم في أي سن.\n" +
                "سرطان عنق الرحم يمكن الوقاية منه من خلال مطعوم جارداسيل (Gardasil).\n" +
                "يقي مطعوم جارداسيل من فيروس الورم الحليمي البشري الذي يسبب 70% من حالات سرطان عنق الرحم."
                ,R.drawable.syringe));


        recyclerView.setHasFixedSize(true);
        mlayoutManager = new LinearLayoutManager(this);
        mAdapter = new RvAdapterOthers(mItems, getApplicationContext());
        recyclerView.setLayoutManager(mlayoutManager);
        recyclerView.setAdapter(mAdapter);

        // طلب اظهار سهم العودة للصفحة الرئيسية مع وضع parent in manifest
        ActionBar actionBar = getSupportActionBar();

        if (actionBar != null) {
            actionBar.setDisplayHomeAsUpEnabled(true);
        }
    }
}