package com.jks.amal.TypesOfCancers;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import com.jks.amal.R;

import java.util.ArrayList;
import java.util.List;


public class ChildrenFragment extends Fragment {

    private List<ItemsTypes> mList;
    View view;

    public ChildrenFragment() {
        // Required empty public constructor
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        view = inflater.inflate(R.layout.fragment_children, container, false);
        RecyclerView recyclerView = view.findViewById(R.id.recyclerView_xml);
        RecyclerViewAdapterTypes recyclerAdapter = new RecyclerViewAdapterTypes(getContext(), mList);
        recyclerView.setLayoutManager(new LinearLayoutManager(getActivity()));
        recyclerView.setAdapter(recyclerAdapter);
        return view;
    }


    @Override
    public void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

        mList = new ArrayList<>();
        mList.add(new ItemsTypes("ورم الأرومي الكبدي"
                , "الورم الأرومي الكبدي هو نوع من سرطانات الكبد التي تصيب الأطفال والرضّع."
                , "قد تكون الإصابة بهذا الورم مرتبطة بالولادة المبكّرة ووضع الطفل في الخداج، أو الوزن القليل عند الولادة، أو وجود تاريخ عائلي للسرطان. مع هذا، فإنّ وجود أيّ من هذه العوامل لا يعني بالضّرورة أنّ الطفل سيصاب بسرطان الورم الأرومي الكبدي."
                , "عادةً لا تظهر أيّ أعراض للإصابة بالورم الأرومي الكبدي، وغالبا ما يتم إيجاد الورم خلال فحص روتيني معتاد حيث يظهر على شكل كتلة في البطن. وفي بعض الحالات، قد تظهر بعض الأعراض مثل فقدان الوزن، انتفاخ البطن، الحمّى، التقيؤ، اليرقان."
                , "غالبا ما يكون العلاج الكيماوي فعّالا، ويتبعه الجراحة، ثم يعاد العلاج الكيماوي مرة أخرى بعد الجراحة."
                , "تصوير بالأمواج فوق الصوتيّة لتحديد الورم والقيام بتشخيص أوّلي.\n" +
                "فحص الدم ألفا فيتو برويتن (Alpha feto protein)، حيث يكون هذا البروتين مرتفعا عند حديثي الولادة، لكنّه يعود للمستويات الطبيعية (<10) في عمر الستّة أشهر. بعض الأورام قد يكون لها مستويات مرتفعة من هذا البروتين (قد يصل إلى أكثر من مليون وقت التشخيص). وبالعلاج الفعال يمكن أن ينخفض إلى المستوى الطبيعي.\n" +
                "أخذ خزعة من الورم. ", ""));
        mList.add(new ItemsTypes("سرطان البلعوم الأنفي عند الأطفال",
                "هو نوع نادر من أنواع السرطان ويصيب الجزء العلوي من الحلق خلف الأنف. عادة ما يصيب الأشخاص من جنوب شرق آسيا وشمال إفريقيا."
                , "لم يتم تحديد أسباب الإصابة بسرطان البلعوم الأنفي عند الأطفال، لكن من الأرجح أن الإصابة بفيروس أبشتاين-بار (Eppstein-Bar virus-EBV) لها دور في تطوّر هذا النوع من السرطان."
                , "التهاب في الحلق.\n" +
                "نزيف الأنف.\n" +
                "صعوبة في التنفّس أو النطق.\n" +
                "مشاكل في الأذنين، ألم أو طنين في الأذن.\n" +
                "مشاكل في السمع.\n" +
                "كتلة في الأنف أو الرقبة.\n" +
                "صداع."
                , "عادة ما تتضمّن خطة العلاج العلاج الإشعاعي والعلاج الكيماوي. وقد يُعطي العلاج الإشعاعي بحذر شديد لتجنّب حدوث أيّ تعقيدات أو تأثيرات جانبية بعيدة المدى. كما يجب الاهتمام بنظافة وصحّة الفم والأسنان بشكل خاص. "
                , "صورة الرنين المغناطيسي و/أو التصوير المقطعي للحصول على صورة كاملة للحلق والمناطق المحيطة.\n" +
                "التنظير بالخلايا البصريّة (Fiber-optic endoscopy) للمجرى الهوائي العلوي.\n" +
                "التنظير الأنفي (Nasal endoscopy) من خلال أنبوب صغير في نهايته كاميرا يتم إدخاله عبر الأنف للبحث عن أيّ مؤشّرات لوجود سرطان.\n" +
                "أخذ خزعة من نسيج البلعوم الأنفي وفحصها تحت المجهر.\n" +
                "صورة أشعّة سينيّة للصدر للبحث عن أيّ انتشار للورم إلى الرئتين.\n" +
                "رصد متكرر لوجود فيروس أبشتاين-بار في الدم.", ""));
        mList.add(new ItemsTypes("الورم الجذعي العصبي"
                , "الورم الجذعي العصبي هو نوع من السرطان الذي ينشأ في الغدد الكظرية فوق الكلى. تنتج الغدد الكظرية هرمونات تساعد على ضبط مستويات النبض وضغط الدم ووظائف حيوية أخرى. غالبا ما يصيب هذا المرض الأطفال دون سن الخامسة."
                , "غالبا ما تؤدّي الطفرات الجينيّة إلى إصابة الأطفال بالورم الجذعي العصبي."
                , "تورّم أو كتلة في البطن.\n" +
                "انتفاخ البطن.\n" +
                "الضعف والخمول.\n" +
                "الإسهال.\n" +
                "مشاكل في الحركة.\n" +
                "ألم العظام."
                , "قد يتضمّن العلاج الجراحة، والعلاج الكيماوي، والعلاج الإشعاعي و/أو عملية زراعة نخاع العظم. ويُعالج الأطفال دون عمر السنة ممّن ما زالوا في المراحل المبكّرة من المرض عن طريق إعطائهم من 4 إلى 8 دورات من العلاج الكيماوي. أما المراحل المتقدّمة من المرض، فيتم علاجها بالعلاج الكيماوي المكثّف مع زراعة نخاع العظم الذّاتي، متبوعا بمشتقّ فيتامين أ الذي يعطى عن طريق الفم لمدة ستة أشهر."
                , "فحص (MIBG) وهو فحص تصويري باستخدام اليود المشعّ لفحص الجسم والكشف عن بقع الورم الجذعي العصبي.\n" +
                "فحص العظام للبحث عن الأورام.\n" +
                "التصوير المقطعي لتحديد الأعضاء التي أصيبت بورم الجذع العصبي.\n" +
                "فحص البول للكشف عن مستويات بروتين يسمى (VMA).\n" +
                "خزعة من نخاع العظم لفحص إصابة نخاع العظم.", ""));
        mList.add(new ItemsTypes("سرطان خلايا العظم النسيجي عند الأطفال"
                , "سرطان العظم النسيجي هو نوع نادر من السرطان الذي ينشأ في العظم، وهو أكثر شيوعا عند الأطفال والشباب، وغالبا ما يصيب الأشخاص بين عمر 10 و25 سنة."
                , "السبب المحدّد لسرطان العظم غير معروف، لكن هناك طفرات جينية قد تزيد من احتمالية الإصابة به. كما أن التعرّض السابق للعلاج الإشعاعي أو بعض أدوية السرطان مثل (Alkylating Agents)، يمكن أن تزيد فرصة الإصابة كذلك."
                , "ألم وتورّم داخل العظمة أو حولها.\n" +
                "صعوبة الحركة.\n" +
                "كسر العظم بسهولة دون سبب."
                , "يتمّ الاعتماد على العلاج الكيماوي، يليه إجراء جراحة لإزالة الورم، حيث يحرص الفريق الجراحي على إنقاذ الأطراف وإزالة الورم دون الحاجة لبتر الطرف المصاب. وفي حال انتشار المرض إلى الرئة، فقد يتم التدخّل الجراحي لإزالة الأجزاء المصابة في الرئة.\n" +
                "\n" +
                "كما أنّ سرطان العظم لا يتجاوب مع الأشعّة، لكنه يستخدم فقط لتسكين الألم."
                , "يتم تشخيص سرطان العظم عن طريق إجراء صورة أشعّة سينيّة للعظام بالإضافة إلى أخذ خزعة، كما قد يقوم الأطباء بعمل تصوير مقطعي أو رنين مغناطيسي للصدر لاستبعاد انتشار السرطان إلى الرئة.", ""));
        mList.add(new ItemsTypes("سرطان الدم عند الأطفال"
                , "سرطان الدم (اللوكيميا) هو أكثر أنواع السرطانات التي تصيب الأطفال، حيث يصيب خلايا الدم والنسيج الذي يشكّل خلايا الدم، مثل نخاع العظم."
                , "في معظم حالات سرطان الدم عند الأطفال، لا توجد أسباب معروفة لتطوّر المرض."
                , "أنواع سرطان الدم:\n" +
                "\n" +
                "سرطان الدم الحاد (Acute Leukemia): ينمو بسرعة كبيرة جدا، وقد يهدّد الحياة. في هذه النوع يبدأ نخاع العظم بإنتاج أعداد كبيرة من خلايا دم بيضاء غير ناضجة تسمّى (Blasts)، والتي تدخل إلى مجرى الدم. هذه الخلايا غير الناضجة تعمل بسرعة على مزاحمة الخلايا الطبيعية في مجرى الدم ولا تقوم بوظيفتها في محاربة العدوى أو إيقاف النزيف أو منح حدوث فقر الدم، ما يجعل الجسم ضعيفا جدا.\n" +
                "\n" +
                "\n" +
                "النوعان الأكثر شيوعا لسرطان الدم الحاد هما:\n" +
                "\n" +
                "سرطان الدم الليمفاوي الحاد (ALL).\n" +
                "سرطان الدم النقياني الحاد (AML).\n" +
                " \n" +
                "\n" +
                "سرطان الدم المزمن (Chronic Leukemia): يتطوّر ببطء ويتفاقم تدريجيا، وقد تحتاج الأعراض لفترة طويلة قبل أن تبدأ بالظهور. وفي بعض الأحيان يتم تشخيص سرطان الدم المزمن من خلال الفحص الروتيني قبل حتى ظهور أيّ أعراض، لأن الخلايا السرطانية في هذه الحالة تكون ناضجة لدرجة كافية للقيام بوظائفها مثل خلايا الدم البيضاء الطبيعية، قبل أن تبدأ بالتفاقم.\n" +
                "\n" +
                "\n" +
                "هناك نوعان رئيسيان لسرطان الدم المزمن:\n" +
                "\n" +
                "سرطان الدم الليمفاوي المزمن (CLL).\n" +
                "سرطان الدم النقياني المزمن (CML)."
                , "يتلقى المرضى الأطفال مجموعة من العلاجات الكيماوية. وفي بعض الحالات قد يحتاجون إلى عملية زراعة نخاع العظم.\n" +
                "\n" +
                "وبالنسبة لعلاج سرطان الدم الليمفاوي المزمن تحديدا، يتم اللجوء إلى العلاج الكيماوي، والعلاج الإشعاعي، والعلاجات الموجهة التي تستهدف خلايا سرطانية محدّدة دون التأثير على الخلايا الأخرى. في بعض الأحيان، قد تلزم الجراحة لإزالة طحال متضخّم. "
                , "فحص الدم (CBC) بالإضافة إلى فحص وظائف الكلى، وفحص وظائف الكبد وفحص تحديد مستوى حامض اليوريك. كما أن فحص مسحة الدم تحت المجهر ضروري للبحث عن أيّ خلايا سرطانية.\n" +
                "خزعة نخاع العظم هي أكثر الفحوصات شيوعا لتحديد نوع سرطان الدم.\n" +
                "البزل القطني (Spinal Tap) للبحث عن خلايا سرطانية في السائل الشوكي (Cerebrospinal Fluid) وهو السائل الذي يملأ الفراغات داخل وحول الدماغ والحبل الشوكي.\n" +
                "فحص الوراثيات الخلوية (Cytogenic Analysis) حيث ينظر المختبر إلى الكروموسومات في الخلايا من عينات الدم أو نخاع العظم أو الغدد الليمفاوية لتحديد ما إذا كان هناك أيّ مشاكل وراثية. على سبيل المثال فإن الأشخاص الذين يعانون من سرطان الدم النقياني المزمن لديهم كروموسوم غير طبيعي يسمّى كروموسوم فيلادلفيا.\n" +
                "التشخيص الجزيئي الذي يتضمّن فحص تفاعل البلمرة المتسلسل (PCR) للكشف عن آثار الخلايا السرطانية في الجسم، وفحص \"مضان التهجين في الموقع\" (FISH) للكشف عن أي خلل في الكروموسومات في الحمض النووي للخليّة.", ""));
        mList.add(new ItemsTypes("سرطان الدماغ عند الأطفال"
                , "ورم الدماغ هو نمو غير طبيعي للخلايا داخل الدماغ. هذه الأورام قد تظهر تحت المجهر، ومن خلال فحص الأنسجة يتم تحديدها على أنها حميدة أو خبيثة بناء على مواصفات خلاياها. لكن من المهم معرفة مكان الورم بالدماغ حيث يحدد ذلك الكثير من المشاكل الصحية المترتبة عليه، بما فيها القدرة على اسئصاله كليا ومدى استجابته للعلاج. ومن المهم أيضا إدراك أن أورام الدماغ عند الأطفال تختلف عن أورام الدماغ عند الكبار، من حيث نشاطها وطرق علاجها ومدى استجابتها للعلاج."
                , "لا يعرف بالتحديد ما الذي يسبب أورام الدماغ عند الأطفال، ولكن نسبة ضئيله منها (أقل من 10%) قد تكون لأسباب وراثية وجينية، لهذا من المهم الاطّلاع على التاريخ الطبي للعائلة. مع هذا، فإن بعض الأطفال لديهم حالات وراثية تزيد فرص إصابتهم بأورام الدماغ مثل:\n" +
                "\n" +
                "Neurofibromatosis (NF1 &2)\n" +
                "Tuberous Sclerosis\n" +
                "Li Fraumeni syndrome\n" +
                "Biallelic Mismatch Repair syndrome (BMMRD)\n" +
                "لذا، من المهم تمييز هذه الحالات مبكرا للقيام بالفحص الدوري مما يقلل من مضاعفات الورم على الدماغ ويزيد من فرص الشفاء. "
                , "تعتمد الأعراض على عمر الطفل لكنها عادة قد تشمل:\n" +
                "\n" +
                "ميلان الرأس المتكرر بصورة غير طبيعية.\n" +
                "زيادة في محيط الرأس غير متلائمة مع عمر الطفل.\n" +
                "الغثيان والقيء المتكرر (غير المصحوب عادة بارتفاع درجة الحرارة أو الإسهال).\n" +
                "الصداع المستمر أو المتكرر.\n" +
                "اختلال في التوازن وعدم القدرة على المشي بشكل سليم.\n" +
                "الحول أو رفرفة العين أو ضعف النظر.\n" +
                "تغير في السلوك كالخمول وقلة النشاط.\n" +
                "حركات لا إرادية وتشنجات.\n" +
                "اضطرابات في البلوغ (بلوغ مبكر أو متأخر).\n" +
                "الإكثار بشكل غير طبيعي من شرب الماء والتبول."
                , "يتم تقييم الصور من قبل أخصائي الأشعة التشخيصية، وأورام الأطفال، وجراحة الأعصاب، لترجيح نوع الورم وتحديد امكانية إجراء جراحة لاسئصال الورم كليا أو جزئيا، أو عمل خزعة لأغراض التشخيص المخبري.\n" +
                "\n" +
                "يتم فحص الخزعة من قبل أطباء الأنسجة المختصين، وتحديد الاسم العلمي لنوع ورم الدماغ والذي سيتقرر بناء عليه الخطوات اللاحقه للعلاج، والتي قد تتضمن المراقبة بصور الرنين المغناطيسي فقط، أو البدء بالعلاج الإشعاعي أو العلاج الكيماوي، أو الجراحة (ويمكن الجمع بين هذه الخيارات حسب حالة الطفل المريض). يتم تحديد خطة العلاج من قبل استشاريين من مختلف الاختصاصات ويتم إقرارها جماعيا."
                , "عاده ما يتأخر تشخيص سرطان الدماغ عند الأطفال، فالأعراض قد تتطوّر بشكل تدريجي وقد لا تظهر جميعها. كما أن أي من الأعراض المذكورة أعلاه قد تكون مؤشرات لحالات مرضية أخرى أكثر شيوعا عند الأطفال. لذا، فإذا كان طفلك يعاني من أي من هذه الأعراض، يجب مناقشتها مع الطبيب.\n" +
                "\n" +
                "يبدأ التشخيص بمراجعة السيرة المرضية للطفل والاطلاع على تسلسل الأعراض لديه، وإذا كانت لديه مشاكل صحية سابقة، بالإضافة إلى تاريخ العائله الطبي. ثم يتم إجراء فحص سريري بدني وعصبي متكامل، بعدها يتم إجراء صورة رنين مغناطيسي للدماغ (وأحيانا يضاف إليها صورة للحبل الشوكي لمعرفة مدى انتشار الورم).", ""));
        mList.add(new ItemsTypes("الورم العضلي المخطط عند الأطفال"
                , "ورم العضل المخطط هو سرطان يتطوّر من الخلايا العضليّة. وهو أكثر الأنواع شيوعا من بين أنواع سرطان الأنسجة الرخوة عند الأطفال."
                , "أسباب الإصابة بورم الأطفال العضلي المخطط غير معروفة، مع هذا، فإنّ هناك بعض الأمراض المتوارثة التي قد تزيد من فرصة الإصابة به. فإذا كان الطفل قد ورث حالة مرضيّة معيّنة مثل متلازمة \"لي فروميني\" أو الورم العصبي الّليفي، يجب استشارة الطبيب."
                , "ظهور كتلة تستمر في النمو.\n" +
                "صعوبة في التبوّل أو دم في البول.\n" +
                "صداع.\n" +
                "نزيف من الأنف أو الحلق أو المهبل أو المستقيم."
                , "يعتبر العلاج الكيماوي المتبوع بالعلاج الإشعاعي هو نمط العلاج المتّبع لهذا النوع من السرطان، وقد تكون الجراحة خيارا حسب موقع الورم. \n" +
                "\n"
                , "يتم تشخيص ورم الأطفال العضلي المخطط عن طريق فحوصات الدم، وصور الأشعّة السينيّة، والتصوير المقطعي، والرنين المغناطيسي، للحصول على صور تفصيلية للمناطق داخل الجسم، وتحديد موقع وحجم الورم، وما إذا كان قد انتشر لمناطق أخرى في الجسم. كما يتم أخذ خزعة عن طريق إزالة عيّنة من نسيج العظم لفحصه في المختبر.\n", ""));
        mList.add(new ItemsTypes("مرض كثرة المنسجات"
                , "هو اضطراب يحصل لخلايا الدم البيضاء. بالرغم من أنّ هذا المرض ليس سرطانا، إلا أنّه يشبه السرطان ويعالَج من قِبل أطباء الأورام بنفس الطريقة. وهو عادة ما يصيب الأطفال، ولكن يمكن أن يصيب الأشخاص في أيّ سن."
                , "كثرة المنسجات لخلايا لانجرهانز (Langerhans cell histiocytosis)، ويسمّى أيضا كثرة المنسجات الأكسية (histiocytosis X).\n" +
                "متلازمة كثرة المنسجات الخبيثة (Malignant histiocytosis syndrome)، والمعروفة باسم (T-cell lymphoma).\n" +
                "كثرة المنسجات عدا خلايا لانجرهانس (Non-Langerhans cell histiocytosis)، والمعروفة باسم (hemophagocytic syndrome).\n" +
                "والنوع الأكثر شيوعا هو كثرة المنسجات لخلايا لانجرهانز (LCH).\n" +
                " \n" +
                "\n" +
                "مرض كثرة المنسجات\n" +
                "\n" +
                "يعد العامل الوراثي سببا لبعض أنواع مرض كثرة المنسجات."
                , "السعال.\n" +
                "الحمّى.\n" +
                "آلام العظام.\n" +
                "آلام الصدر.\n" +
                "فقدان الوزن.\n" +
                "العطش المفرط.\n" +
                "التبوّل المفرط.\n" +
                "طفح، أو غيرها من آفات الجلد غير الطبيعية.\n" +
                "ضيق في التنفّس.\n" +
                "صعوبة في المشي."
                , "يتم العلاج بالجراحة، والعلاج الكيماوي، والعلاج الإشعاعي بدرجات متفاوتة. يخضع المرضى الذين يعانون من المرض في عضو معين مثل الجلد أو العظام للعلاج على شكل علاج كيماوي موضعي، أو كشط للعظم المصاب، وقد يكون هذا كل ما يحتاجون إليه. أما المرضى الذين تتضمّن إصابتهم بقع متعدّدة من العظم أو أكثر من عضو، فإن العلاج الكيماوي والمنشّطات (steroids) قد تكون فعّالة.\n" +
                "\n" +
                "بعض المرضى الذين تتضمّن إصابتهم العديد من الأعضاء والجهاز العصبي المركزي (مثل الدماغ والعمود الفقري) يحتاجون لعلاج مكثّف، وفي بعض الأحيان لزراعة نخاع العظم المتماثل عن طريق الإخصاب الخلطي (allogenic). "
                , "يتم عادة إجراء أشعة سينيّة للعظام والصدر، بالإضافة إلى فحوصات للدم. وإذا كان هناك شكّ بإصابة الجلد، يقوم الطبيب بأخذ خزعة من الجلد.\n" +
                "\n" +
                "وبالنسبة لتقييم الغدد الصمّاء، فهو إجراء ضروري لاستبعاد اضطرابات الغدّة النخامية التي قد تحدث للمرضى الذين تكون إصابتهم بالجمجمة. كما يمكن أن يُجرى تصوير مقطعي للصدر والبطن إذا كان هناك شكّ بإصابة الأعضاء الداخلية، خاصّة للمرضى الذين تكون نتائج فحص وظائف الكبد لديهم غير طبيعية. \n", ""));
        mList.add(new ItemsTypes("الأورام الليمفاوية عدا هودجكين عند الأطفال"
                , "الليمفوما هو سرطان يبدأ في خلايا الجهاز المناعي، وتحديدا في خلايا الدم البيضاء المصمّمة لمحاربة العدوى وحماية الجسم من الأمراض. هناك نوعان من الأورام الليمفاوية: مرض هودجكين، والأورام الليمفاوية عدا هودجكين."
                , "تفاصيل"
                , "السعال.\n" +
                "الحمّى.\n" +
                "آلام العظام.\n" +
                "آلام الصدر.\n" +
                "فقدان الوزن.\n" +
                "العطش المفرط.\n" +
                "التبوّل المفرط.\n" +
                "طفح، أو غيرها من آفات الجلد غير الطبيعية.\n" +
                "ضيق في التنفّس.\n" +
                "صعوبة في المشي."
                , "تم العلاج بالجراحة، والعلاج الكيماوي، والعلاج الإشعاعي بدرجات متفاوتة. يخضع المرضى الذين يعانون من المرض في عضو معين مثل الجلد أو العظام للعلاج على شكل علاج كيماوي موضعي، أو كشط للعظم المصاب، وقد يكون هذا كل ما يحتاجون إليه. أما المرضى الذين تتضمّن إصابتهم بقع متعدّدة من العظم أو أكثر من عضو، فإن العلاج الكيماوي والمنشّطات (steroids) قد تكون فعّالة.\n" +
                "\n" +
                "بعض المرضى الذين تتضمّن إصابتهم العديد من الأعضاء والجهاز العصبي المركزي (مثل الدماغ والعمود الفقري) يحتاجون لعلاج مكثّف، وفي بعض الأحيان لزراعة نخاع العظم المتماثل عن طريق الإخصاب الخلطي (allogenic). "
                , "يتم عادة إجراء أشعة سينيّة للعظام والصدر، بالإضافة إلى فحوصات للدم. وإذا كان هناك شكّ بإصابة الجلد، يقوم الطبيب بأخذ خزعة من الجلد.\n" +
                "\n" +
                "وبالنسبة لتقييم الغدد الصمّاء، فهو إجراء ضروري لاستبعاد اضطرابات الغدّة النخامية التي قد تحدث للمرضى الذين تكون إصابتهم بالجمجمة. كما يمكن أن يُجرى تصوير مقطعي للصدر والبطن إذا كان هناك شكّ بإصابة الأعضاء الداخلية، خاصّة للمرضى الذين تكون نتائج فحص وظائف الكبد لديهم غير طبيعية."
                , ""));
        mList.add(new ItemsTypes("الأورام الليمفاوية عدا هودجكين عند الأطفال"
                , "الليمفوما هو سرطان يبدأ في خلايا الجهاز المناعي، وتحديدا في خلايا الدم البيضاء المصمّمة لمحاربة العدوى وحماية الجسم من الأمراض. هناك نوعان من الأورام الليمفاوية: مرض هودجكين، والأورام الليمفاوية عدا هودجكين.\n" +
                "\n" +
                "ويتم تمييز هذه الأورام حسب سرعة أو بطء نموّها، ونوع خلايا الدم البيضاء التي يبدأ فيها السرطان (خلايا تي أو خلايا بي). هناك أربعة أنواع رئيسية للأورام الليمفاوية عدا هودجكين عند الأطفال:\n" +
                "\n" +
                "الأورام الليمفاوية صغيرة الخلايا غير المنفطرة (ورم \"بيركيت\" الليمفاوي-Burkitt lymphoma).\n" +
                "الأورام الليمفاوية كبيرة الخلايا (Diffuse large B-cell lymphoma).\n" +
                "الأورام الأرومية الليمفاوية (Lymphoblastic lymphoma).\n" +
                "الأورام الليمفاوية للخلايا الكبيرة المتحوّلة (Anaplastic large cell lymphoma).     "
                , "تبدأ الأورام الليمفاوية عدا هودجكين عندما تصبح خلايا الدم البيضاء (خلايا تي أو خلايا بي) خلايا غير طبيعية. ثم تبدأ هذه الخلايا بالنمو والانقسام منتجة المزيد من الخلايا غير الطبيعية. عندما تزداد أعداد هذه الخلايا، فإنها تبدأ بمنافسة خلايا الدم البيضاء السليمة ومنعها من القيام بوظيفتها التي تتمثّل في حماية الجسم من العدوى والأمراض.\n" +
                "\n" +
                "وهناك عوامل يمكن أن تزيد من احتمالية تطوّر الأورام الليمفاوية عدا هودجكين، منها:\n" +
                "\n" +
                "الإصابة بعدوى فيروس ابشتاين- بار (EBV)، وهي عدوى فيروسية شائعة تسبّب مرض يسمى (Mononucleosis).\n" +
                "الإصابة بفيروس نقص المناعة البشرية (HIV) المسبب لمرض الإيدز.\n" +
                "الإصابة بفيروس الكبد الوبائي نوع (C).\n" +
                "ضعف الجهاز المناعي.\n" +
                "إنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضّرورة إصابة الشخص بالأورام الليمفاوية عدا هودجكين. وعلى العكس، فإن الأشخاص الذين ليس لديهم أي عوامل خطورة قد يصابون بالمرض.\n"
                , "وجود كتل غير مؤلمة (غدد ليمفاوية متضخّمة) تحت الجلد هو أكثر الأعراض شيوعا.\n" +
                "تورّم في الرأس أو الرقبة، أو الجزء العلوي من الجسم أو الذراعين.\n" +
                "مشاكل في التنفّس.\n" +
                "الحمّى.\n" +
                "تعرّق ليلي.\n" +
                "سعال مستمر."
                , "لا يوجد مريضين متشابهين حتى وإن كانا يعانيان من نفس نوع الورم الليمفاوي. لذا، يتم التعامل مع كل حالة على حدة. ويمكن أن تتضمّن خطة العلاج جلسات العلاج الكيماوي، والإشعاعي، وزراعة نخاع العظم، أو أيّ من هذه العلاجات مجتمعة."
                , "من الضروري أخذ خزعة للحصول على تشخيص صحيح وتحديد نوع المرض الفرعي.\n" +
                "صورة أشعّة سينيّة للصدر.\n" +
                "تصوير مقطعي للمناطق المصابة والأعضاء الداخلية للكشف عن مدى انتشار المرض خاصة في الصدر والبطن.\n" +
                "تصوير مقطعي بالإصدار البوزيتروني (PET scan).\n" +
                "فحص الدم (CBC) للبحث عن وجود فقر دم أو تعداد منخفض للخلايا البيضاء أو الصفائح في حالات اصابة نخاع العظم.\n" +
                "فحوص دم أخرى بما فيها فحص سرعة الترسيب في الدم (ESR)، وفحوصات وظائف الكلى والكبد."
                , ""));
        mList.add(new ItemsTypes("ورم هودجكين عند الأطفال"
                , "مرض هودجكين هو نوع من السرطان ينشأ في خلايا الجهاز المناعي، تحديدا في خلايا الدم البيضاء المصمّمة لمحاربة العدوى، وحماية الجسم من الأمراض. وهو أحد أمراض الأورام الليمفاوية. يتم تمييز مرض هودجكن حسب وجود نوع من الخلايا يدعى (ريد-ستيرنبيرغ)، وهو نوعان:\n" +
                "\n" +
                "مرض هودجكن الكلاسيكي (Classical Hodgkin lymphoma).\n" +
                "غلبة الليمفاوي العقيدي (Nodular lymphocyte predominant- Hodgkin lymphoma)."
                , "يتطوّر مرض هودجكن عندما يبدأ نوع معيّن من خلايا الدم البيضاء تسمى خلايا بي بالنموّ بشكل غير طبيعي. هذه الخلية غير الطبيعية تسمى خلية (ريد-ستيرنبيرغ)، وهي أكبر بكثير من الخلية الطبيعيّة. تبدأ خلايا (ريد-ستيرنبيرغ) بالنمو والانقسام، وإنتاج المزيد من الخلايا غير الطبيعية، والتي تعمل على منع الجهاز المناعي من القيام بوظيفته في حماية الجسم، حيث أنّ هذه الخلايا لا تحارب العدوى مثلما تفعل الخلايا الطبيعيّة.\n" +
                "\n" +
                "لا يوجد سبب معروف لمرض هودجكن، لكن هناك عوامل خطورة قد تزيد من خطورة الإصابة به، وهي:\n" +
                "\n" +
                "الإصابة بعدوى فيروس ابشتاين بار (EBV)، وهي عدوى فيروسية شائعة تسبّب مرض يسمى (Mononucleosis).\n" +
                "التاريخ العائلي (وجود أخ أو أخت أصيبوا بالمرض).\n" +
                "إنّ وجود أحد عوامل الخطورة هذه لا يعني بالضّرورة إصابة الشخص بمرض هودجكن."
                , "تورّم غير مؤلم في العقد الليمفاوية.\n" +
                "تورّم في الرأس أو الرقبة أو الجزء العلوي من الجسم أو الذراعين.\n" +
                "الحمّى.\n" +
                "خسارة الوزن دون تفسير.\n" +
                "تعرّق ليلي.\n" +
                "سعال مستمر.\n" +
                "ضيق في التنفّس.\n" +
                "ارتفاع صوت التنفّس.\n" +
                "قد تكون هذه الأعراض أيضا مؤشّرات لحالات مرضية أخرى، لذا يجب استشارة الطبيب في حال ظهرت لدى طفلك أيّ منها."
                , "لا يوجد مريضين متشابهين، حتى وإن كانا يعانيان من نفس نوع الورم الليمفاوي. لذا، يتم التعامل مع كل حالة على حِدة.\n" +
                "\n" +
                "يحتاج معظم المرضى إلى العلاج الكيماوي والإشعاعي، وفي حال عدم الاستجابة للعلاج أو في حالة الانتكاس، يخضع المرضى لعملية زراعة نخاع العظم، أو الخلايا الجذعيّة المحيطية، وتكون النتائج جيّدة. وعادة، لا تعتبر الجراحة خيارا في علاج مرضى هودجكن."
                , "من الضروري أخذ خزعة للحصول على تشخيص صحيح وتحديد نوع المرض الفرعي.\n" +
                "صورة أشعّة سينيّة للصدر.\n" +
                "تصوير مقطعي للمناطق المصابة والأعضاء الداخليّة للكشف عن مدى انتشار المرض خاصّة في الصدر والبطن.\n" +
                "تصوير مقطعي بالإصدار البوزيتروني (PET Scan) من خلال جهاز يعمل على دمج صور التصوير المقطعي (CTScan) والتصوير المقطعي بالإصدار البوزيتروني (PET Scan).\n" +
                "خزعة نخاع العظم.\n" +
                "فحوصات الدم، بما فيها تحليل سرعة الترسيب في الدم (ESR)، وتعداد الدم الكامل (CBC) وفحوصات وظائف الكبد والكلى."
                , ""));
        mList.add(new ItemsTypes("ورم ويلمز"
                , "ورم ويلمز هو نوع نادر من سرطان الكلية وغالبا ما يظهر في كلية واحدة. حوالي 90% من سرطانات كلى الأطفال هي أورام ويلمز."
                , "بعض الحالات المتوارثة والمشاكل الخلقيّة قد تزيد من احتمالية تطور ورم ويلمز. فإذا ولد طفل مصابا بحالة وراثية معيّنة، يجب استشارة الطبيب وفحصه بشكل دوري."
                , "قد تظهر بعض الأعراض لدى الأطفال المصابين بورم ويلمز (إلا أنها قد تكون أعراضا لحالات مرضية أخرى) وهي:\n" +
                " \n" +
                "انتفاخ أو ألم في البطن.\n" +
                "كتلة في البطن.\n" +
                "دم في البول.\n" +
                "حمّى."
                , "يتم تحديد خطة العلاج حسب مدى انتشار المرض في الجسم. والعلاج النموذجي لورم ويلمز هو الجراحة متبوعا بالعلاج الكيماوي، وقد يحتاج المريض للعلاج الإشعاعي بناء على مرحلة المرض."
                , "صور الموجات فوق الصوتيّة.\n" +
                "التصوير المقطعي.\n" +
                "صور الرنين المغناطيسي.", ""));
    }
}