package com.jks.amal.TypesOfCancers;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;


import com.jks.amal.R;

import java.util.ArrayList;
import java.util.List;


public class MenFragment extends Fragment {

    View view;
    private List<ItemsTypes> mList;

    public MenFragment() {
        // Required empty public constructor
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        view = inflater.inflate(R.layout.fragment_men_cancer, container, false);
        RecyclerView recyclerView = view.findViewById(R.id.recyclerView_xml);
        RecyclerViewAdapterTypes recyclerAdapter = new RecyclerViewAdapterTypes(getContext(), mList);
        recyclerView.setLayoutManager(new LinearLayoutManager(getActivity()));
        recyclerView.setAdapter(recyclerAdapter);
        return view;
    }


    @Override
    public void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

        mList = new ArrayList<>();
        mList.add(new ItemsTypes("سرطان أرومة الشبكية"
                , "ورم أرومة الشبكية هو سرطان يصيب شبكية العين، وهي النسيج العصبي الذي يبطّن الجزء الخلفي من العين من الداخل. قد يظهر الورم في عين واحدة أو في العينين، وهو أكثر شيوعا عند الأطفال تحت سن خمس سنوات."
                , "حوالي 40% من حالات ورم أرومة الشبكية عند الأطفال متوارثة من الوالدين. أما بالنسبة لبقيّة الحالات فإنّ سبب الإصابة غير معروف."
                , ""
                , "يتضمّن العلاج بعض الإجراءات الجراحية وفي العديد من الحالات يمكن إنقاذ العين، كما يتم إعطاء المرضى العلاج الحراري، والعلاج بالتبريد، والعلاج الإشعاعي.\n" +
                "\n" +
                "ويقوم فريق يتكوّن من طبيب أورام، وطبيب عيون، وأخصائي أشعّة أورام بمناقشة الحالات المعقّدة مع خبراء على المستوى الدولي. أهم هدف للعلاج هو إنقاذ حياة المريض ومن ثم إنقاذ الرؤية والشكل. في بعض الحالات يكون من الصعب تحقيق هذه الأهداف دون العلاج الكيماوي والعلاج الإشعاعي. وغالبا ما تكون الجراحة الخيار الأخير عندما تكون العلاجات الأخرى غير فعّالة في علاج الورم. "
                , "فحص العين بالموجات فوق الصوتية لتحديد الورم.\n" +
                "الفحص تحت التخدير: من الضروري إجراء الفحص تحت التخدير عند الأطفال للوصول إلى تشخيص دقيق.\n" +
                "تصوير الرأس بالرنين المغناطيسي للبحث عن انتشار الورم إلى الجمجمة.", ""));
        mList.add(new ItemsTypes("سرطان الأمعاء الدقيقة"
                , "سرطان الأمعاء الدقيقة هو نوع نادر من السرطان يتشكّل داخل الأمعاء الدقيقة."
                , "اتّباع نظام غذائي غني بالدهون المشبعة أو الحيوانية.\n" +
                "مرض حساسية القمح (Celiac disease) وهو عدم القدرة على هضم مادة الجلوتين.\n" +
                "مرض كرون (Crohn disease) وهو مرض التهابي يصيب الأمعاء الدقيقة والغليظة."
                , "وجود كتلة في البطن.\n" +
                "وجود دم في البراز.\n" +
                "فقدان الوزن دون سبب.\n" +
                "الشعور بألم أو تشنّجات في البطن."
                , "قد يتضمّن علاج سرطان الأمعاء الدقيقة الجراحة، والعلاج الكيماوي والعلاج الإشعاعي."
                , "حقنة الباريوم (صورة أشعّة سينيّة خاصّة بالأمعاء).\n" +
                "فحص الدم الخفي في البراز.\n" +
                "فحص المستضد السرطاني المضغي (Carcino-embryonic antigen-CEA).\n" +
                "فحص وظائف الكبد.\n" +
                "التصوير المقطعي أو الرنين المغناطيسي للصدر والبطن والحوض للكشف عن انتشار السرطان.", ""));
        mList.add(new ItemsTypes("سرطان الأنسجة الرخوة"
                , "ورم الأنسجة الرخوة هو نوع نادر من السرطان الذي يصيب العضل، أو الدهون، أو النسيج الّليفي، أو الأوعية الدمويّة، أو أيّ أنسجة داعمة أخرى، لذا فقد يتطوّر في أيّ مكان في الجسم، لكنه غالبا ما ينشأ في الذّراعين والسّاقين. وهناك عدد قليل فقط من المراكز حول العالم التي يمكنها التعامل بفاعليّة مع هذا النوع من الأورام. "
                , "ما زالت الأسباب مجهولة، لكن بعض العائلات لديها قابليّة وراثيّة للإصابة به. وهناك بعض الحالات والطّفرات الوراثيّة التي تزيد من احتمالية تطوّر هذا المرض. كما أن التعرّض السابق للعلاج الإشعاعي، أو الأدوية المضادّة للسرطان والتي تسمى (Alkylating Agents)، قد تزيد من فرصة الإصابة. إنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضّرورة إصابة الشخص بورم الأنسجة الرخوة."
                , "قد تظهر أورام الأنسجة الرخوة على شكل كتلة تحت الجلد، غالبا على أحد الذراعين أو السّاقين. وقد لا يكون هناك أي أعراض. عندما يصبح الورم كبيرا، يبدأ المريض بالشعور بالألم بسبب ضغط الورم على الأعضاء، أو العضلات أو الأعصاب. وعلى عكس أورام العظم، فإنّ الألم ليس من الأعراض الرئيسيّة لأورام الأنسجة الرخوة."
                , "تعتبر الجراحة أول خطوة في علاج أورام الأنسجة الرخوة، وقد يتم اللجوء للعلاج الكيماوي والإشعاعي."
                , "يتم التشخيص عن طريق إجراء فحص بدني كامل، بالإضافة لأخذ خزعة لفحصها في المختبر والبحث عن أيّ خلل. كما أنّ صورة الرنين المغناطيسي (MRI) للطرف المصاب ضروريّة لتقدير الانتشار المحلّي للمرض، بينما يكون التصوير المقطعي للصدر ضروريّ لتحديد ما إذا كان المرض قد انتشر للرئة. كما أن مسح العظام ضروري لتحديد ما إذا كان المرض قد انتشر للعظم.", ""));
        mList.add(new ItemsTypes("سرطان البلعوم الأنفي"
                , "سرطان البلعوم الأنفي هو أحد أنواع سرطانات الرأس والرقبة الذي يصيب الجزء الأعلى من الحلق خلف الأنف، وعادة ما يصيب الأشخاص من أصول آسيوية."
                , "التعرض لفيروس أبشتاين-بار (Eppstein-Bar virus-EBV).\n" +
                " شرب الكحول بكثرة. \n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان البلعوم الأنفي."
                , "التهاب في الحلق.\n" +
                "نزيف الأنف.\n" +
                "صعوبة في التنفس أو النطق.\n" +
                "مشاكل في الأذنين، ألم أو طنين في الأذن.\n" +
                "مشاكل في السمع.\n" +
                "كتلة في الأنف أو الرقبة.\n" +
                "صداع."
                , "يعتمد العلاج على عدة عوامل، منها عمر المريض ومرحلة المرض بالإضافة إلى حجم الورم، ولكنه غالبا ما يتضمن الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي."
                , "صورة الرنين المغناطيسي (MRI).\n" +
                "التصوير المقطعي بالإصدار البوزتروني (PET scan).\n" +
                "التصوير المقطعي (CT scan).\n" +
                "التنظير بالخلايا البصرية (Fiber-optic endoscopy) للمجرى الهوائي العلوي.\n" +
                "التنظير الأنفي (Nasal endoscopy).\n" +
                "أخذ خزعة من نسيج البلعوم الأنفي وفحصها تحت المجهر.\n" +
                "صورة أشعة سينية للصدر للبحث عن أي انتشار للورم إلى الرئتين.", ""));
        mList.add(new ItemsTypes("سرطان البلعوم الفموي"
                , "سرطان البلعوم الفموي هو أحد أنواع سرطانات الرأس والرقبة الذي يصيب الجزء الأوسط من الحلق الموجود خلف الفم. والبلعوم الفموي، هو المنطقة التي تشمل مؤخرة اللسان واللوزتين."
                , "التدخين.\n" +
                "شرب الكحول بكثرة.\n" +
                "النظام الغذائي الخالي من الفاكهة والخضراوات.\n" +
                "الإصابة بفيروس الورم الحليمي البشري (HPV).\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان البلعوم الفموي."
                , "السعال المستمر.\n" +
                "التهاب في الحلق.\n" +
                "تغير في الصوت.\n" +
                "كتلة في الفم أو الرقبة أو الحلق.\n" +
                "فقدان وزن غير مبرر.\n" +
                "ألم في الأذن.\n" +
                "صعوبة في البلع."
                , "يعتمد العلاج على عدة عوامل، منها عمر المريض ومرحلة المرض بالإضافة إلى حجم الورم، ولكنه غالبا ما يتضمن الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي. وفي حال أدى العلاج إلى فقدان الصوت، يتم تطبيق إجراء طبي يعرف باستعادة الصوت الأساسي، حيث يستعيد حوالي 90% من المرضى صوتهم بنجاح."
                , "فحص الدم (CBC).\n" +
                "صورة الرنين المغناطيسي (MRI).\n" +
                "تصوير مقطعي بالإصدار البوزيتروني (PET scan).\n" +
                "التصوير المقطعي (CT scan).\n" +
                "التنظير بالخلايا البصرية (Fiber-optic endoscopy).\n" +
                "الخزعة.\n" +
                "صورة أشعة سينية للصدر للبحث عن أي انتشار للورم إلى الرئتين.", ""));
        mList.add(new ItemsTypes("سرطان البلعوم السفلي"
                , "سرطان البلعوم السفلي هو أحد أنواع سرطانات الرأس والرقبة ويصيب الجزء الأسفل من الحلق (البلعوم) والذي يصل إلى المريء."
                , "التدخين ومضغ التبغ.\n" +
                "شرب الكحول بكثرة.\n" +
                "اتباع نظام غذائي غير صحي.\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان البلعوم السفلي."
                , ""
                , "وفي حال أدت بعض الإجراءات العلاجية إلى فقدان المرضى الصوت بشكل مؤقت، يتم تطبيق إجراء يعرف باستعادة الصوت الأساسي حيث يستعيد حوالي 90% من المرضى صوتهم بنجاح. "
                , "صورة الرنين المغناطيسي (MRI) للحصول على صورة كاملة للحلق والمناطق المحيطة.\n" +
                "التصوير المقطعي بالإصدار البوزتروني (PET Scan).\n" +
                "التصوير المقطعي (CT scan) للحصول على صورة كاملة للحلق والمناطق المحيطة.\n" +
                "التنظير بالخلايا البصرية (Fiber-optic Endoscopy) للمجرى الهوائي العلوي.\n" +
                "تنظير المريء (Esophagoscopy).\n" +
                "أخذ خزعة من نسيج البلعوم وفحصها جيدا تحت المجهر.\n" +
                "صورة أشعة سينية للصدر للبحث عن أي انتشار للورم إلى الرئتين.\n" +
                "صور أشعة سينية للرأس والرقبة.\n", ""));
        mList.add(new ItemsTypes("سرطان البروستاتة"
                , "سرطان البروستاتة هو السرطان الذي ينشأ في غدة البروستاتة، وهي جزء من الجهاز التناسلي الذكري. وهو عادة ما يصيب الرجال الأكبر سنا. وإذا تم اكتشاف المرض مبكرا، فقد يعاني المريض من أعراض جانبية محدودة ومؤقتة."
                , "التقدم في السن، حيث أن الرجال بعد سن 60 سنة أكثر عرضة للإصابة.\n" +
                "الاستعداد الوراثي، حيث تزداد فرص الإصابة في حال أصيب الأب أو الأخ بسرطان البروستاتة.\n" +
                "النظام الغذائي الغني بالدهون خاصة الحيوانية.\n" +
                "شرب الكحول بكثرة.\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان البروستاتة."
                , "لا يشعر الكثير من المرضى بأيّ أعراض، ويتم تشخيصهم فقط في حال القيام بفحص دم يسمى فحص مستضد البروستاتة النوعي (PSA). لذا، ننصح بالقيام بفحوصات الكشف المبكر في عيادة الكشف المبكر .\n" +
                "\n" +
                "أما المرضى الذي يلاحظون بعض الأعراض فهي:\n" +
                "\n" +
                "تكرر التبول أو مشاكل في التبول.\n" +
                "وجود دم في البول.\n" +
                "ألم في الظهر أو الساق.\n" +
                "فقدان الشهية وألم في العظام (في حال انتشار المرض)."
                , " يعتمد علاج سرطان البروستاتة على مرحلة المرض وعمر المريض بالإضافة إلى حالته الصحية بشكل عام.\n" +
                "\n" +
                "الجراحة\n" +
                "إن إزالة البروستاتة بالكامل (الاستئصال الجذري للبروستاتة) هو أكثر علاجات سرطان البروستاتة شيوعا.\n" +
                "\n" +
                "تتم غالبية عمليات سرطان البروستاتة الجراحية بأسلوب يحاول الحفاظ على الأعصاب التي تتحكم في عملية الانتصاب. وتقلل هذه العمليات الجراحية التي تحافظ على الأعصاب سلس البول، والعجز الجنسي، ولكنها تبقى احتمالية خطرهما.\n" +
                "\n" +
                "\n" +
                "العلاج الإشعاعي\n" +
                "العلاج الإشعاعي هو استخدام الأشعة السينية أو الحزم الإلكترونية المركزة أو النظائر المشعة ذات القوة العالية لقتل الخلايا السرطانية وتقليص حجم الورم.\n" +
                "\n" +
                "يحول العلاج الإشعاعي الكروموسومات في الخلايا إلى أيونات أو يلحق بها الضرر، بحيث تصبح غير قادرة على التكاثر. يمكن إنتاج الأشعة من جهاز موجود خارج الجسم (أشعة خارجية).\n" +
                "\n" +
                "\n" +
                "العلاج الإشعاعي هو علاج موضعي يصوب مباشرة على السرطان. وبالرغم من تصويب الأشعة على السرطان فقط، إلا أنه يجب أن يمر من خلال الجلد والعظام الأخرى ليصل إلى الورم. وبالتالي، فإن بعض الخلايا السليمة يمكن أن تصاب بالأذى أيضاً. ومع ذلك، فالجسم قادر على إصلاح الخلايا السليمة التي تضررت وإعادتها إلى وظيفتها الصحيحة. ويعتمد نجاح العلاج الإشعاعي على نقل كمية الأشعة المناسبة إلى السرطان بأفضل طريقة وأكثرها فعالية.\n" +
                "\n" +
                "\n" +
                "العلاج بتوجيه الإشعاع الخارجي:\n" +
                "\n" +
                "إن العلاج بتوجيه الإشعاع الخارجي هو الشكل الأكثر شيوعا للعلاج الإشعاعي. قبل بدء العالج، يتم وضع الخطط المفصلة أو إجراء المحاكاة. خلال إجراء المحاكاة، يستعمل الأخصائيون القياسات المتأتية عن الفحوصات والحسابات لتحديد موقع تصويب الأشعة الصحيح. ويمكن أن تستغرق المحاكاة عدة ساعات.\n" +
                "\n" +
                "خلال المعالجة يوضع المريض على طاولة بحيث يتم تصويب شعاع على الورم من جهاز موجود خارج الجسم. وتدوم المعالجة بالأشعة نفسها بضعة دقائق فقط وتعطى إجمالاَ خمس مرات في الأسبوع لعدة أسابيع.\n" +
                "\n" +
                "\n" +
                "بعض الاختلافات التقنية لتوجيه الأشعة الخارجية هي:\n" +
                "\n" +
                "جرعة عالية من العلاج بالأشعة ثلاثية الأبعاد HD3D.\n" +
                "العلاج بالأشعة ذات الشدة المتغيرة IMRT.\n" +
                "العلاج بالأشعة رباعية الأبعاد CALYPSO.\n" +
                "تعتبر هذه الأشكال من العلاج بالأشعة عالية التخصص وتستخدم في أطر محددة جداً\n" +
                "\n" +
                "\n" +
                "العلاج الكيميائي\n" +
                "يستخدم العلاج الكيميائي الأدوية للقضاء على خلايا السرطان. يمكن أخذ العلاج الكيميائي عن طريق الفم أو كحقنة في الوريد. ويعتبر العلاج الكيميائي علاجا منهجيا، أي أن الأدوية تدخل مجرى الدم وتنتقل عبر الجسم وتستطيع القضاء على خلايا السرطان في أي مكان في الجسم، ومن ضمنها البروستاتة.\n" +
                "\n" +
                "يعطى العلاج الكيميائي في دورات علاجية متبوعة بمدة للشفاء. وعادة ما تستمر كامل مدة العالج بالمواد الكميائية بين ثلاثة إلى ستة أشهر، حسب نوعية الأدوية التي يتم إعطاؤها.\n" +
                "\n" +
                "\n" +
                "متى يعطى العلاج الكيميائي؟\n" +
                "\n" +
                "يمكن استخدام العلاج الكيميائي في حالات سرطان البروستاتة المتكررة أو المتقدمة، ولكنها لا تستخدم عادة لمعالجة المرض في مرحلتها المبكرة.\n" +
                "\n" +
                "\n" +
                "العلاج الهرموني:\n" +
                "من المعروف أن خلايا سرطان البروستاتة تنمو بمساعدة الهرمون الذكري وهناك طرق متعددة للسيطرة على الخلايا السرطانية المنتشرة بالجسم من خلال إعطاء هرمونات تعمل على تقليل الهرمون الذكري في الجسم، وبالتالي تقلل معدل نمو الخلايا المنتشرة."
                , "فحص بدني كامل.\n" +
                "فحص مستضد البروستاتة النوعي (PSA) للبحث عن نوع من البروتين الذي تنتجه الخلايا في غدة البروستاتة.\n" +
                "أخذ خزعة من البروستاتة.\n" +
                "فحص الموجات فوق الصوتية عبر المستقيم لأخذ صورة وخزعة عن غدة البروستاتة.\n" +
                "تصوير مقطعي للحوض والعظم للبحث عن انتشار المرض.", ""));
        mList.add(new ItemsTypes("سرطان البنكرياس"
                , "سرطان البنكرياس هو السرطان الذي يبدأ في البنكرياس أي في الغدّة التي تقع بين المعدة والعمود الفقري، والتي تفرز الأنسولين وهرمونات أخرى، وتساعد الجسم على استخدام الطاقة التي تنتج عن الطعام أو تخزينه. ويمكن لسرطان البنكرياس أن ينتشر بسرعة كبيرة."
                , "البدانة.\n" +
                "التدخين.\n" +
                "السكري.\n" +
                "وجود تاريخ عائلي للإصابة بسرطان البنكرياس.\n" +
                "التهاب البنكرياس المزمن."
                , "اصفرار الجلد والعينين.\n" +
                "ألم في الجزء العلوي من البطن أو الظهر.\n" +
                "بول غامق اللون.\n" +
                "البراز الذي يبدو شاحبا أو يطفو داخل الحمام.\n" +
                "الغثيان.\n" +
                "الإرهاق.\n" +
                "فقدان الوزن دون سبب.\n" +
                "فقدان الشهيّة.\n" +
                "مع هذا، فإنّ معظم هذه الأعراض لا تظهر عادة في المراحل المبكّرة من المرض، لذا ننصح بإجراء فحوصات الكشف المبكّر بشكل دوري، لتشخيص السرطان في مراحله المبكرة حيث يكون أكثر قابليّة للشفاء."
                , "يعد العلاج الكيماوي، والعلاج الإشعاعي، والجراحة خيارات العلاج المتاحة لمرضى سرطان البنكرياس. وغالبا ما تكون الجراحة أول خطوة في العلاج لإزالة الورم بشكل كامل. ويمكن الشفاء من سرطان البنكرياس إذا تم تشخيصه في مراحل مبكّرة."
                , "التصوير بالأمواج فوق الصوتية.\n" +
                "التصوير المقطعي.\n" +
                "صور الرنين المغناطيسي.\n" +
                "اختبار (Endoscopic retrograde cholangiopancreatography-ERCP) وهو اجراء يستخدم لفحص وتشخيص أمراض الكبد والقناة الصفراوية والبنكرياس.\n" +
                "التصوير بالموجات فوق الصوتية باستخدام المنظار والخزعة الموجهة بالموجات فوق الصوتية.\n" +
                "أخذ خزعة عن طريق المنظار للحصول على عيّنات من النسيج داخل وحول البنكرياس لإجراء المزيد من الفحوصات.", ""));
        mList.add(new ItemsTypes("سرطان التجويف الأنفي والجيوب الأنفية الجانبية"
                , "سرطان التجويف الأنفي والجيوب الأنفية الجانبية هو أحد أنواع سرطانات الرأس والرقبة الذي يصيب منطقة الجيوب الأنفية الجانبية وهي فراغات مليئة بالهواء موجودة في الجمجمة حول الأنف، وهي مبطنة بالخلايا التي تنتج المخاط."
                , "التدخين.\n" +
                "التعرض للكيماويات والغبار الصناعية كتلك الموجودة في صناعة الأثاث، ومنشرة الخشب، والنجارة، وطلاء المعادن، والعمل بالطحين أو الخبز.\n" +
                "الإصابة بفيروس الورم الحليمي البشري (HPV).\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان التجويف الأنفي والجيوب الأنفية الجانبية."
                , "الصداع.\n" +
                "ألم أو ضغط في منطقة الجيوب الأنفية.\n" +
                "ألم أو ضغط في الأذن.\n" +
                "نزيف الأنف.\n" +
                "كتل في الوجه أو داخل الفم أو الأنف.\n" +
                "ألم الأسنان أو فقدان الأسنان.\n" +
                "سيلان الأنف."
                , "يعتمد العلاج على عدة عوامل، منها عمر المريض ومرحلة المرض بالإضافة إلى حجم الورم، ولكنه غالبا ما يتضمن درجات متفاوتة من الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي."
                , " صورة الرنين المغناطيسي (MRI).\n" +
                "التصوير المقطعي بالإصدار البوزتروني (PET scan).\n" +
                "التصوير المقطعي (CT scan).\n" +
                "التنظير بالخلايا البصرية (Fiber-optic endoscopy) للمجرى الهوائي العلوي.\n" +
                "التنظير الأنفي (Nasal endoscopy).\n" +
                "أخذ خزعة من نسيج الأنف أو الجيوب الأنفية وفحصها جيدا تحت المجهر.\n" +
                "صورة أشعة سينية للصدر للبحث عن انتشار للورم إلى الرئتين.\n" +
                "صور أشعة سينية للرأس والرقبة.", ""));
        mList.add(new ItemsTypes("سرطان التجويف الفموي"
                , "سرطان التجويف الفموي هو أحد أنواع سرطانات الرأس والرقبة الذي يصيب الفم، ويمكن أن يتضمن أجزاء من الشفاه، والثلثين الأماميين من اللسان، واللثة، والبطانة الداخلية للخدين، والشفاه، وقاعدة الفم (الجزء الموجود تحت اللسان) وسقف الفم، والمنطقة الصغيرة من اللثة خلف الأضراس."
                , "لا تعرف بالتحديد أسباب سرطان التجويف الفموي، إلا أن هناك عدة عوامل خطورة قد تزيد من احتمالية الإصابة به، وهي:\n" +
                "\n" +
                "التدخين.\n" +
                "شرب الكحول بكثرة.\n" +
                "سوء العناية بنظافة الفم وفقدان الأسنان."
                , "ألم غير معتاد أو نزيف في الفم.\n" +
                "ورم في اللسان أو بطانة الفم أو اللثة.\n" +
                "ألم أو التهاب في الفك.\n" +
                "ألم الأسنان أو أسنان متخلخلة."
                , "يعتمد العلاج على عدة عوامل، منها عمر المريض ومرحلة المرض بالإضافة إلى حجم الورم، ولكنه غالبا ما يتضمن درجات متفاوتة من الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي."
                , "صورة الرنين المغناطيسي (MRI) للحصول على صورة كاملة للرأس والرقبة.\n" +
                "التصوير المقطعي بالإصدار البوزيتروني (PET scan).\n" +
                "التصوير المقطعي (CT scan) للحصول على صورة كاملة للرأس والرقبة.\n" +
                "أخذ خزعة من نسيج الفم وفحصها جيدا تحت المجهر.\n" +
                "صورة أشعة سينية للصدر للبحث عن أي انتشار للورم إلى الرئتين.\n" +
                "صور أشعة سينية للرأس والرقبة.", ""));
        mList.add(new ItemsTypes("سرطان التليف النقي"
                , "التليّف النقي هو مرض بطيء النمو يحدث عندما تتراكم الندب النسيجية داخل نخاع العظم، وتعمل على استبدال نخاع العظم السليم المسؤول عن إنتاج خلايا الدم السليمة. وجود الندب في نخاع العظم يوقف قدرته على إنتاج خلايا الدم السليمة، ويزيد فرصة حدوث فقر الدم، والعدوى والنزيف."
                , "ما زالت أسباب التليّف النقي مجهولة، كما لا توجد أي عوامل خطورة معروفة، وهو عادة ما يصيب الأشخاص فوق سن الخمسين. كما قد تسبب بعض الأمراض مثل سرطان الدم، والليمفوما تندّب نخاع العظم، وهذا ما يسمّى التليّف النقي الثانوي. "
                , "الضّعف والإرهاق.\n" +
                "ألم تحت الأضلاع على الجانب الأيسر.\n" +
                "الشعور بالامتلاء بعد تناول كمية قليلة من الطعام (علامات تضخم الطحال).\n" +
                "ضيق في النفس.\n" +
                "الحمّى.\n" +
                "سهولة حدوث النزيف أو الكدمات.\n" +
                "العدوى المتكرّرة.\n" +
                "شحوب في الجلد."
                , "هناك أنواع مختلفة من العلاج للتليّف النقي، وتعتمد على حالة المريض الصحية. الهدف من العلاج هو السيطرة على المرض لتحسين نوعية حياة المريض. وقد يتضمن ذلك العلاج الكيماوي، ونقل الدم، والجراحة (لإزالة الطحال المتضخّم)، وزراعة الخلايا الجذعية المتماثلة بطريقة الإخصاب الخلطي."
                , "فحص تعداد الدم الكامل (CBC) وفحوصات دم أخرى.\n" +
                "اللطاخة (المسحة) الدموية المحيطية للبحث عن أيّ خلل في شكل أو اكتمال خلايا الدم.\n" +
                "شفط أو خزعة لنخاع العظم لفحص وجود أيّ خلل في نخاع العظم.\n" +
                "فحص الوراثيات الخلوية (Cytogenic Analysis)، للبحث عن أيّ تغيرات في كروموسومات خلايا الدم أو نخاع العظم.", ""));
        mList.add(new ItemsTypes("اضطرابات التكاثر النقيي المزمنة"
                , "اضطرابات التكاثر النقيي المزمنة هي مجموعة من الأمراض التي تحدث عندما يقوم نخاع العظم بإنتاج خلايا دم أكثر من الّلازم (سواء خلايا دم بيضاء أو خلايا دم حمراء أو صفائح)، حيث تمنع هذه الخلايا الزائدة الخلايا الأخرى من القيام بوظيفتها بشكل صحيح. وقد يتطوّر التكاثر النقيي المزمن ليصبح لوكيميا حادة،"
                , "ما زالت أسباب اضطرابات التكاثر النقيي المزمنة غير معروفة، ولا توجد أيّ عوامل خطورة معروفة كذلك، وهي عادة ما تحدث للأشخاص فوق سنّ الخمسين. \n"
                , ""
                , "هناك أنواع مختلفة من علاج اضطرابات التكاثر النقيي، حيث تعتمد على نوع المرض وحالة المريض وصحته. وقد يتضمّن العلاج الكيماوي، وعمليات نقل دم، والجراحة (لإزالة الطحال المتضخم)، وزراعة خلايا جذعية، وعمليات الفصادة (Phlebotomy) وعلاج حيوي. "
                , "فحص تعداد الدم الكامل (CBC) وغيرها من فحوصات الدم.\n" +
                "اللطاخة (المسحات) الدموية المحيطية (Peripheral Blood Smear) للبحث عن أيّ خلل في شكل أو نضج خلايا الدم.\n" +
                "خزعة أو شفط من نخاع العظم لفحص وجود أيّ خلل في نخاع العظم.\n" +
                "فحص الوراثيات الخلوية (Cytogenetic Analysis) للبحث عن أيّ تغيّرات في كروموسومات خلايا الدم أو نخاع العظم.", ""));
        mList.add(new ItemsTypes("سرطان الجلد"
                , "سرطان الجلد هو نمو الأورام في الجلد وهناك أنواع مختلفة من سرطان الجلد حسب نوع الخلايا الجلدية التي ينشأ بها الورم. \n" +
                "\n" +
                "\n" +
                "الأنواع الأكثر شيوعا لسرطان الجلد هي:\n" +
                "\n" +
                "سرطان الجلد الميلاني (Melanoma)، الذي ينشأ في الخلايا الصبغية (Melanocytes) التي تمنح الجلد لونه.\n" +
                "سرطان الخلايا الصدفية (Squamous cell Carcinoma) الذي ينشأ في الخلايا الصدفية المسطحة التي تشكل الطبقة العليا من الجلد.\n" +
                "سرطان الخلايا القاعدية (Basal cell Carcinoma) الذي ينشأ في الخلايا القاعدية الموجودة في الطبقة العليا من الجلد أسفل الخلايا الصدفية."
                , "السبب الرئيسي لسرطان الجلد هو التعرّض الطويل لأشعة الشمس، والأشعة فوق البنفسجية الصادرة عنها. كما أن الأشخاص ذوي البشرة الفاتحة والشعر الأشقر هم أكثر عرضة للإصابة بشكل عام من الأشخاص ذو البشرة الدّاكنة والشعر الغامق. في الواقع، فإنّ أيّ تعرض للأشعة فوق البنفسجية مثل العلاج الإشعاعي وأجهزة التسمير الداخلية والتعرض للإشعاع في العمل يزيد من فرصة الإصابة بسرطان الجلد.\n" +
                "\n" +
                "\n" +
                "كما يمكن أن ينشأ سرطان الجلد الميلاني من الشامات الموجودة في جسمك، لذا يجب فحص هذه الشامات بشكل منتظم لمراقبة أيّ تغيّر في لونها أو حجمها أو شكلها. وإذا لاحظت أيّ تغير، أخبر طبيبك على الفور. كما يمكن أن يظهر سرطان الجلد دون أي سبب معروف.\n" +
                "\n" +
                "إنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضّرورة إصابة الشخص بسرطان الجلد، إلا أنها قد تزيد من احتماليّة الإصابة به."
                , "شامة جديدة أو تغيّر في شامة موجودة هما أكثر المؤشّرات شيوعا لاحتمال الإصابة بسرطان الجلد الميلاني، خاصة التغيّر في لون الشامة و/أو زيادة قطرها أو ارتفاعها أو عدم تماثل حدودها.\n" +
                "نزيف، حكة، تقرّح وألم في الشامة هي من الأعراض الأقلّ شيوعا ولكن تحتاج إلى تقييم.\n" +
                "نمو جديد على البشرة، جرح لا يلتئم، أو تغيّر على نمو قديم."
                , "تعتمد طريقة علاج سرطان الجلد على مرحلة المرض، ويمكن أن تتفاوت من إزالة بسيطة للشامة أو المنطقة المصابة، وصولا إلى العلاج الإشعاعي، والعلاج بالتبريد، والعلاج المناعي بالإضافة إلى الجراحة."
                , "يقوم الطبيب بأخذ خزعة استئصالية لإزالة أيّ نسيج غير طبيعي، ثم يقوم بتحديد التشخيص ومرحلة الورم. وتعتبر سماكة الورم أو عمقه (Breslow Depth) المؤشّر الأكثر أهميّة في التشخيص. وتتوفّر  تقنية التعرّف على العقد الليمفاوية المصابة وإزالتها لفحصها بالتفصيل."
                , ""));
        mList.add(new ItemsTypes("سرطان الحنجرة"
                , "سرطان الحنجرة هو السرطان الذي يصيب ما نطلق عليه \"صندوق الصوت\" ويعرف أيضا بسرطان الحلق، ويمكن أن ينتشر للغدد الليمفاوية المحيطة بالرأس والرقبة."
                , "التدخين.\n" +
                "شرب الكحول بكثرة.\n" +
                "التعرض لنشارة الخشب، وغاز الخردل، والإسبتس، والإشعاع المؤين.\n" +
                "الارتداد المعدي المزمن.\n" +
                "التهاب الحنجرة المزمن أو إساءة استخدام الصوت.\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان الحنجرة."
                , "صعوبة التنفس أو البلع.\n" +
                "خشونة في الصوت أو تغيرات صوتية أخرى.\n" +
                "ألم في الأذن.\n" +
                "السعال المستمر مع دم أو مواد متكتلة.\n" +
                "ألم في الحلق لأكثر من ستة أسابيع."
                , "يعتمد العلاج الذي سيتلقاه المريض بسرطان الحنجرة على عدة عوامل منها عمر المريض ومرحلة المرض، ولكنه غالبا ما يتضمن الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي. \n" +
                "\n" +
                "أما في الحالات المتقدمة، فقد يحتاج المرضى إلى استئصال الحنجرة (Laryngectomy) ويتبعها إعادة تأهيل وتدريب للمرضى لتمكينهم من معاودة النطق. وعندما يؤثر العلاج على الصوت، يتم تطبيق إجراء طبي يعرف باستعادة الصوت الأساسي، حيث يستعيد حوالي 90% من المرضى صوتهم بنجاح. "
                , "فحص الدم (CBC).\n" +
                "فحص وظائف الغدة الدرقية.\n" +
                "التنظير بالخلايا البصرية (Fiber-optic endoscopy) للمجرى الهوائي العلوي.\n" +
                "التصوير المقطعي (CT scan) لتقييم حجم ومدى انتشار الورم.\n" +
                "صورة أشعة سينية للصدر للبحث عن أي انتشار للورم إلى الرئتين.", ""));
        mList.add(new ItemsTypes("أورام الحبل الشوكي"
                , "تعتبر أورام النخاع الشوكي من الأورام النادرة، حيث أن نسبة حدوثها 0.24 \\100000 وتقسم إلى عدة أنواع:\n" +
                "\n" +
                "حميدة 70%.\n" +
                "خبيثة 30%.\n" +
                "\n" +
                "وإما أن تكون من خلايا الحبل الشوكي ويكون الورم داخل الحبل الشوكي:"
                , "ورم دبقي Glioma وهو عدة درجات:\n" +
                "\n" +
                "حميد\n" +
                "دبقي درجة ثانية\n" +
                "خبيث درجة ثالثة\n" +
                "خبيث درجة رابعة\n" +
                "الورم البطاني العصبي Ependymoma\n" +
                "\n" +
                "ورم أرومي وعائي Haemangioblastoma.\n" +
                "\n" +
                " \n" +
                "\n" +
                "أو أن تكون من أغشية الأعصاب: ورم شفاني Schwannoma\n" +
                "\n" +
                "أو من الأنسجة المحيطة حول النخاع الشوكي مثل الأم الجافية أو الأم العنكبوتية: الأورام السحائية  Meningioma"
                , "حدوث تقلّصات أو تشنّجات في العضلات.\n" +
                "صعوبة في المشي.\n" +
                "ألم في الرقبة أو الظّهر.\n" +
                "خدران أو وخز في الذّراعين أو السّاقين أو كلاهما.\n" +
                "الإرهاق والخمول.\n" +
                "في بعض الحالات سلس البول (عندما يقع الورم في الجزء السفلي من الحبل الشوكي."
                , "تعتبر عمليات النخاع الشوكي من العمليات الدقيقة التي تتطلب مهارات عالية، حيث يتم تحديد منطقة الورم بدقة من خلال وضع علامة خاصة أثناء تصوير الرنين المغناطيسي.\n" +
                "\n" +
                "يتم فتح الفقرات بواسطة رأب الصفيحة  Laminoplastyثم بواسطة المجهر الجراحي يتم إجراء عملية إزالة الورم حسب نوعه مع المحافظة على النخاع الشوكى سليما.\n" +
                "\n" +
                " \n" +
                "\n" +
                "هل يحتاج المريض إلى علاج شعاعي أو كيماوي؟\n" +
                "\n" +
                "يتم فحص الورم في مختبر الأنسجة ويتم تحديد نوعه، هنالك بعض الأورام بحاجة إلى علاجات شعاعية."
                , "يتم فحص المريض سريريا من حيث القوة والارتدادات العصبية والإحساس في الأطراف، وتقيَّم الحركة والمشي.\n" +
                "\n" +
                "ثم تجرى صورة رنين مغناطيسي عالِ الجودة للمنطقة التي تم تحديدها سريريا، وقد يتم تصوير المريض صور مقطعية طبقية حسب الحاجة.", ""));
        mList.add(new ItemsTypes("سرطان الخصية"
                , "هو السرطان الذي يتشكل في الخصيتين، وهي جزء من الجهاز التناسلي الذكري."
                , "يبدأ سرطان الخصية في أغلب الحالات في الخلايا التناسلية التي تنتج الحيوانات المنوية في الخصيتين، وهذا النوع من السرطان أكثر شيوعا بين الذكور الشباب ومتوسطي العمر.\n" +
                "\n" +
                "\n" +
                "ولا يعرف بالتحديد سبب الإصابة بسرطان الخصية، لكن هناك عوامل خطورة تزيد من احتمالية الإصابة به، وهي:\n" +
                "\n" +
                "وجود الخصية المعلّقة.\n" +
                "المرور في حالة تطوّر غير طبيعي للخصيتين.\n" +
                "وجود تاريخ سابق للإصابة بسرطان الخصية.\n" +
                "وجود تاريخ عائلي للإصابة بسرطان الخصية (خاصة لدى الأب أو الأخ).\n" +
                "إنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضّرورة إصابة الشخص بسرطان الخصية.\n"
                , ""
                , "يتم علاج سرطان الخصية بناء على حجم الورم ومرحلة تقدّمه. حيث يتم استئصال الخصية المصابة، وقد يحتاج المريض للعلاج الشعاعي أو الكيمياوي بناء على مرحلة المرض وقرار اللجنة المشتركة للأورام. بعض العلاجات قد تؤدّي إلى العقم، لذا نشجع مرضانا الذين يرغبون بالإنجاب فيما بعد على تخزين الحيوانات المنوية قبل البدء بالعلاج.\n" +
                "\n" +
                "\n" +
                "تعتمد خيارات علاج سرطان الخصية على عدة عوامل منها نوع السرطان ومرحلته وصحتك العامة:\n" +
                "\n" +
                "\n" +
                "الجراحة\n" +
                "جراحة إزالة الخصية (استئصال الخصية الأربي الجذري) وهي الطريقة العلاجية الرئيسة للتعامل مع جميع مراحل سرطان الخصية وأنواع تقريباً.\n" +
                "الجراحة لإزالة العقد اللمفية القريبة (قطع الكيس اللمفي خلف الصفاق) تُجرى عن طريق عمل شق في البطن.\n" +
                " \n" +
                "\n" +
                "العلاج الإشعاعي\n" +
                "يُعد العلاج الإشعاعي خياراً علاجياً يُستخدم في بعض الأحيان مع الأشخاص الذين يعانون من سرطان الخصية من نوع الأورام المنوية. وقد يُنصح بالعلاج الإشعاعي بعد جراحة إزالة الخصية.\n" +
                "\n" +
                "\n" +
                "العلاج الكيماوي\n" +
                "تستخدم في العلاج الكيماوي عقاقير تُفيد في القضاء على الخلايا السرطانية. تنتقل عقاقير العلاج الكيماوي خلال جسمك للقضاء على خلايا السرطان التي قد نزحت من الورم الأصلي. وقد يكون العلاج الكيماوي الطريقة العلاجية الوحيدة في حالتك، أو قد يُنصح بها قبل أو بعد جراحة إزالة العقدة اللمفاوية."
                , "فحص بدني كامل.\n" +
                "صور الأشعة فوق الصوتية للحصول على صور للخصيتين والأنسجة المحيطة بهما.\n" +
                "فحوصات الدم.", ""));
        mList.add(new ItemsTypes("سرطان خلايا العظم النسيجي"
                , "ورم خلايا العظم النسيجي هو نوع نادر من السرطان الذي ينشأ في العظام، وهو السرطان الأكثر شيوعا بين أورام العظام لدى الأعمار من 10 إلى 25 سنة."
                , "إنّ السبب المحدّد للإصابة بورم خلايا العظم النسيجي غير معروف، مع هذا، فإنّ هناك بعض الحالات والطّفرات الوراثية التي قد تزيد من احتماليّة تطوّر المرض. كما أنّ العلاج السابق بالعلاج الإشعاعي، أو الأدوية المضادة للسرطان التي يطلق عليها اسم (Alkylating Agents)، يمكن أن تزيد من فرص الإصابة بالمرض. وإنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضّرورة إصابة الشخص بالمرض."
                , "ألم أو تورّم في الطرف المصاب، ويزداد الألم في فترة الّليل ولا يستجيب لمسكّنات الألم.\n" +
                "    إذا كان الورم قريبا من المفصل، فيمكن أن تكون هناك محدوديّة في حركة المفصل.\n" +
                "    حدوث كسر في العظم دون أيّ سبب."
                , "يعتبر العلاج الكيماوي الخيار الأمثل لهذا النوع من المرض، يليه إجراء جراحة لإزالة الورم دون الحاجة لبتر الطرف المصاب. وفي حال انتشار المرض إلى الرّئة فقد يتم التدخّل الجراحي لإزالة الأجزاء المصابة في الرئة.\n" +
                "\n" +
                "كما أنّ ورم خلايا العظم النسيجي غير حسّاس للإشعاع، لذا، فإنّ العلاج الإشعاعي يستخدم فقط لتسكين الألم ولا يؤدّي إلى أيّ نتائج فعّالة. "
                , "يتم التشخيص عن طريق صورة أشعّة سينيّة للعظام، بالإضافة إلى أخذ خزعة لفحصها في المختبر والبحث عن وجود أيّ خلل. كما أنّ صورة الرنين المغناطيسي (MRI) للطرف المصاب ضروريّة لتقدير الانتشار المحلي للمرض، بينما يكون التصوير المقطعي للصدر ضروريّ لتحديد ما إذا كان المرض قد انتشر للرئة. ومسح العظام ضروريّ لتحديد ما إذا كان المرض قد انتشر لعظام أخرى، ويتم أيضا أخذ خزعة من نخاع العظم للتأكّد من عدم وصول السرطان لنخاع العظم. "
                , ""));
        mList.add(new ItemsTypes("متلازمة خلل التنسج النقوي"
                , "متلازمة خلل التنسج النقوي هي مجموعة من الأمراض التي لا يُنتِج فيها نخاع العظم كميّة كافية من خلايا الدم الطبيعية. وهي لا تُعتبَر سرطان عظم، بل سرطان نخاع العظم. هناك عدة أنواع من أمراض خلل التنسج النقوي."
                , "الخضوع السابق للعلاج الكيماوي أو الإشعاعي.\n" +
                "التعرّض للمعادن الثقيلة مثل الزئبق والرصاص.\n" +
                "التعرّض لمواد كيماوية مثل دخان التبغ، والبنزين، والمبيدات الحشريّة، والمذيبات."
                , "الضعف أو الإرهاق.\n" +
                "الشعور بضيق في النفس.\n" +
                "الحمّى.\n" +
                "سهولة حدوث النزيف أو الكدمات.\n" +
                "عدوى متكرّرة.\n" +
                "شحوب في الجلد. "
                , "هناك أنواع مختلفة من العلاج لمتلازمة خلل التنسج النقوي، وتعتمد على نوع المرض وحالة المريض الصحية العامة. وتعتبر متلازمة خلل التنسج النقوي مرضا مزمنا لا شفاء منه، لذا، فإن الهدف العام من العلاج هو تخفيف الأعراض والسيطرة على المرض لتحسين نوعية حياة المريض. وقد يتضمّن علاج مرضى متلازمة خلل التنسج النقوي العلاج الكيماوي، ونقل الدم، وزراعة الخلايا الجذعية. "
                , "يستخدم الأطباء مجموعة من الإجراءات والتقنيات للحصول على أدقّ تشخيص، بما فيها:\n" +
                "\n" +
                "فحص تعداد الدم الكامل (CBC) وفحوصات دم أخرى.\n" +
                "شفط أو خزعة لنخاع العظم لفحص وجود أيّ خلل في نخاع العظم.\n" +
                "فحص الوراثيات الخلوية (Cytogenic analysis) للبحث عن أيّ تغيرات في كروموسومات خلايا الدم أو نخاع العظم.", ""));
        mList.add(new ItemsTypes("سرطان الدماغ"
                , "ورم الدماغ هو نموّ غير طبيعي للخلايا في الدماغ وقد تكون حميدة أو خبيثة. الأورام الحميدة لا تحتوي على خلايا سرطانية، وبمجرّد إزالتها فإنها نادرا ما تعاود النمو. مع هذا، فقد تسبّب أورام الدماغ الحميدة مشاكل صحيّة خطيرة، ويمكن أن تتحول لتصبح خبيثة. أمّا أورام الدماغ الخبيثة فهي سرطانية، حيث تنمو بسرعة، وتهاجم الأنسجة المحيطة، وعادة ما تهدّد الحياة."
                , "أنواع أورام الدماغ\n" +
                "\n" +
                "أورام الدماغ الأساسيّة: وهي أورام تبدأ في الدماغ، ويتم تصنيفها حسب المنطقة التي تبدأ فيها بالنمو داخل الدماغ أو حسب الخلايا التي تصيبها.\n" +
                "\n" +
                "أورام الدماغ الثانويّة: يسببها السرطان الذي ينشأ في مكان آخر في الجسم، مثل الرئة على سبيل المثال، ولكن ينتشر للدماغ. هذا ما يعرف أيضا بسرطان الدماغ المنتشر.\n" +
                "\n" +
                "\n" +
                "أسباب أورام الدماغ\n" +
                "\n" +
                "لم يتم تحديد السبب الذي يؤدي إلى أورام الدماغ، لكنها أكثر انتشارا بين الأشخاص فوق سنّ الـ 60 (بالرغم من أن أورام الدماغ هي ثاني أكثر السرطانات شيوعا بين الأطفال بعد سرطان الدم)، وهي أكثر شيوعا عند الذكور (حيث أن الأورام السحائية هي الأنواع الوحيدة التي وجد أنها تصيب الإناث أكثر من الذكور)."
                , "عوامل الخطورة التي تزيد فرصة تطوّر أورام الدماغ:\n" +
                "\n" +
                "التعرّض لجرعات عالية من الأشعّة السينية المستخدمة في العلاج الإشعاعي الموجّه للدماغ.\n" +
                "بعض الحالات الوراثيّة النادرة تزيد فرصة الإصابة بأورام الدماغ مثل الورم العصبي الليفي (neurofibromatosis)، ومتلازمة فون هيبل لينداو (Von Hippel-Lindau syndrome)، ومتلازمة لي فروميني (Li-Fraumeni syndrome)، ومتلازمة تركوت (Turcot's syndrome).\n" +
                "\n" +
                "أعراض أورام الدماغ\n" +
                "\n" +
                "الصّداع (يكون شديدا في الصباح).\n" +
                "الغثيان.\n" +
                "عدم وضوح أو تغيّر في الرؤية.\n" +
                "تقلّصات أو تشنّجات في العضلات.\n" +
                "تغيّر في القدرة على الكلام.\n" +
                "صعوبة في البلع.\n" +
                "صعوبة التركيز.\n" +
                "مشاكل في الذاكرة.\n" +
                "تغيّر في المزاج أو الشخصية.\n" +
                "الإرهاق والخمول."
                , "يتم علاج أورام الدماغ من قبل فريق متخصّص من أطباء جراحة الأعصاب، وأخصائي أشعّة الأورام، وأطباء الأورام، وأطباء الأعصاب، وغيرهم من المختصّين. وبناء على نوع الورم الدماغي ومرحلته فإنّ العلاج قد يتضمّن الجراحة والعلاج الإشعاعي والكيماوي."
                , "فحص بدني وعصبي كامل للنظر، والسمع، وردود فعل العضلات، وتناسق الحركة والإحساس، بالإضافة لوظائف عصبيّة أخرى.\n" +
                " صورة رنين مغناطيسي.\n" +
                " صورة تصوير مقطعي للدماغ.\n" +
                " فحص السائل الشوكي (CSF).\n" +
                "أخذ خزعة من خلال الجراحة أو الإبرة للحصول على بعض النسيج لفحصه في المختبر", ""));
        mList.add(new ItemsTypes("سرطان الدم والأنسجة الرخوة - ورم إيوينغ"
                , "ورم إيوينغ هو ثاني أكثر أنواع سرطان العظم شيوعا بعد ورم خلايا العظم النسيجي (Osteosarcoma). يهاجم هذا المرض عادة العظام الطويلة في الذّراعين، والسّاقين، والحوض، والقفص الصّدري. كما يمكن لورم إيوينغ أن يصيب الأنسجة الرخوة ويسمّى ورم إيوينغ خارج عن العظمي (Extraosseous Ewing Sarcoma)، هذا النوع يمكن أن يوجد في الفخذ، والذّراعين، والسّاقين، والرأس، والرّقبة، ويصيب المراهقين والكبار."
                , "لم يُعرف السبب المحدّد لورم إيوينغ، ولكن من المتوقّع أن بعض الاختلالات الوراثية المحدّدة قد تزيد من فرصة الإصابة به.\n"
                , "وجود ألم أو انتفاخ في مكان الورم، زيادة الألم خلال فترة الّليل دون أن يكون مرتبطا بأي نشاط جسدي، كما أنه لا يستجيب لمسكّنات الألم التي تباع في الصيدلية مثل البنادول.\n" +
                "الشعور بوجود كتلة في العظم المصاب، وغالبا ما يبدأ الشّعور بوجود الكتلة بعد شهرين أو ثلاثة من بداية الشّعور بالألم.\n" +
                "حدوث كسر في العظام دون سبب.\n" +
                "إذا كان الورم قريبا من المفصل، فسيلاحظ وجود حركة محدودة.\n" +
                "بعض المرضى يعانون من الحمّى والشّعور بالإرهاق، وفي المراحل متقدّمة يحدث انخفاض في الوزن."
                , "يعدّ العلاج الكيماوي العلاج الأمثل لهذا المرض، يليه إجراء جراحة لإزالة الورم دون الحاجة لبتر الطرف المصاب.\n" +
                "\n" +
                "كما أن ورم إيوينغ يستجيب للعلاج الإشعاعي، وفي حال انتشار الورم إلى الرئة، فإن العلاج الإشعاعي للرئة قد يكون فعّالا. "
                , "يتم التشخيص طريق أخذ صورة أشعّة سينيّة للعظم، بالإضافة إلى أخذ خزعة. يتم من خلال الخزعة إزالة عيّنة من العظم والأنسجة لفحصها في المختبر والبحث عن وجود أيّ خلل.\n" +
                "\n" +
                "كما أنّ أخذ صورة رنين مغناطيسي (MRI) للطرف المصاب ضروريّة لتقدير الانتشار المحلي للمرض، بينما يكون التصوير المقطعي للصدر ضروريّ لتحديد ما إذا كان المرض قد انتشر للرئة. كما أن مسح العظام ضروريّ لتحديد ما إذا كان المرض قد انتشر لعظام أخرى، ويتم أيضا أخذ خزعة من نخاع العظم للتأكد من عدم وصول السرطان لنخاع العظم."
                , ""));
        mList.add(new ItemsTypes("سرطان الدم - اللوكيميا"
                , "سرطان الدم هو نوع من سرطان خلايا الدم والأنسجة التي تنتج خلايا الدم مثل نخاع العظم. في الوضع الصحّي الطبيعي، تنشأ خلايا الدم في نخاع العظم كخلايا جذعية، وتنضج لاحقا لتشكل أنواعا مختلفة من خلايا الدم (خلايا دم حمراء أو خلايا دم بيضاء أو صفائح)، وتنتقل إلى مجرى الدم. أما مَن يعاني من سرطان الدم، فيبدأ نخاع العظم لديه بإنتاج خلايا الدم البيضاء غير الطبيعية التي تدخل إلى مجرى الدم وتبدأ بمنافسة خلايا الدم الطبيعية السليمة، وتمنعها من القيام بوظائفها بالشكل الصحيح. "
                , "أنواع سرطان الدم\n" +
                "\n" +
                "سرطان الدم الحادّ (Acute Leukemia): ينمو ويتفاقم بسرعة كبيرة جدا، وقد يهدّد الحياة. في هذا النوع، يبدأ نخاع العظم بإنتاج أعداد كبيرة من خلايا الدم البيضاء غير الناضجة تسمى (Blasts)، والتي تدخل إلى مجرى الدم. هذه الخلايا غير الناضجة تعمل بسرعة على منافسة الخلايا الطبيعية في مجرى الدم، ولا تقوم بوظيفتها في محاربة العدوى، أو إيقاف النزيف أو منح حدوث فقر الدم، ما يجعل الجسم ضعيفا جدا.\n" +
                "\n" +
                "\n" +
                "النوعان الأكثر شيوعا لسرطان الدم الحادّ هما:\n" +
                "\n" +
                "سرطان الدم الليمفاوي الحادّ (ALL).\n" +
                "سرطان الدم النقياني الحادّ (AML).\n" +
                " \n" +
                "\n" +
                "سرطان الدم المزمن (Chronic Leukemia): يتطوّر ببطء ويتفاقم تدريجيا، وقد تحتاج الأعراض لفترة طويلة قبل أن تظهر. وفي بعض الأحيان يتم تشخيص سرطان الدم المزمن (من خلال الفحص الروتيني) قبل حتى ظهور أي أعراض، لأن الخلايا السرطانية في هذه الحالة تكون ناضجة لدرجة كافية للقيام بوظائفها مثل خلايا الدم البيضاء الطبيعية، قبل أن تبدأ بالتفاقم.\n" +
                "\n" +
                "\n" +
                "أنواع سرطان الدم المزمن:\n" +
                "\n" +
                "سرطان الدم الليمفاوي المزمن (CLL).\n" +
                "سرطان الدم النقياني المزمن (CML).\n" +
                "هناك نوع آخر يسمّى سرطان دم الخلية الشعرية (Hairy Cell Leukemia)، وهو نوع نادر سُمّي حسب شكله تحت المجهر. يصيب هذا النوع من سرطان الدم غالبا كبار السّن، والرّجال بشكل أكبر من النّساء، وتشمل أعراضه الأكثر شيوعا الضعف والإرهاق بسبب فقر الدم.\n" +
                "\n" +
                "\n" +
                "عوامل الخطورة التي تزيد فرص الإصابة باللوكيميا\n" +
                "\n" +
                "التعرّض لمستويات عالية من الأشعّة.\n" +
                "التدخين.\n" +
                "التعرّض لمادة البنزين (المستخدمة في الصناعات الكيماوية، وفي دخان السجائر).\n" +
                "أنواع معيّنة من أدوية العلاج الكيماوي مثل (Etoposide) وأدوية معروفة باسم (Alkylating Agents).\n" +
                "الإصابة بمتلازمة خلل التنسج النقوي (Myelodysplastic Syndrome) وأنواع أخرى من اضطرابات الدم. "
                , "الشعور بالتعب والإعياء.\n" +
                "فقدان الكثير من الوزن دون سبب.\n" +
                "فقدان الشهية أو الشعور بالامتلاء بعد تناول القليل من الطعام.\n" +
                "سهولة حصول النزيف والكدمات.\n" +
                "عدوى متكررة.\n" +
                "حمّى أو تعرّق ليلي غير مفسّر.\n" +
                "انتفاخ العقد الليمفاوية (خاصة في الرقبة وتحت الإبط).\n" +
                "انتفاخ وانزعاج في البطن.\n" +
                "تورّم ونزيف في الّلثة."
                , "علاج سرطان الدم الليمفاوي الحاد: يتضمن العلاج ثلاث مراحل: المعالجة الحثيّة (التحريضية)، والمعالجة ما بعد سكون المرض، وعلاج المداومة (Maintenance Therapy). هذه العلاجات الثلاثة تتضمّن العلاج الكيماوي، والإشعاعي، وزراعة نخاع العظم، والخلايا الجذعية. \n" +
                "\n" +
                "\n" +
                "علاج سرطان الدم النقياني الحاد: عادة يكفي العلاج الكيماوي لعلاج هذا النوع من السرطان لدى بعض المرضى. ولدى البعض الآخر، يتم إجراء زراعة نخاع العظم أو الخلايا الجذعية لزيادة فرص الشفاء، أو في حالة الانتكاس أو تفاقم المرض. من الشائع أن يحتاج المرضى للدعم من خلال نقل الدم، أو الصفائح والمضادّات الحيوية في حال العدوى.\n" +
                "\n" +
                "\n" +
                "علاج سرطان الدم النقياني المزمن: يهدف هذا العلاج إلى القضاء على خلايا الدم التي تحتوي على الجينات غير الطبيعية. وكونه مرض \"مزمن\"، فإن العلاج لن يشفي المريض، لكنه قد يتيح له عيش حياة طبيعية إلى حدّ ما. يتعلّم المرضى كيفية التعامل مع الآثار الجانبية للعلاج طويل الأمد. كما قد يتضمّن العلاج زراعة نخاع العظم، والعلاج الكيماوي والحيوي. وتعتبر الزراعة طريقة مهمّة للأشخاص الأقل سنّا. \n" +
                "\n" +
                "\n" +
                "علاج سرطان الدم الليمفاوي المزمن: تستخدم طرق مختلفة لعلاج سرطان الدم الليمفاوي المزمن، أكثرها شيوعا العلاج الكيماوي، والعلاج الإشعاعي، والعلاجات الموجّهة، وهي العلاجات التي تستهدف خلايا سرطانية محدّدة دون التأثير على الخلايا الأخرى. في بعض الأحيان قد تلزم الجراحة لإزالة طحال متضخّم.\n" +
                "\n" +
                "\n" +
                "علاج سرطان دم الخلية الشعرية: بسبب النمو البطيء لهذا النوع من السرطان، قد لا يحتاج بعض المرضى إلى أيّ علاج، ولكن معظمهم سيحتاجون للعلاج. ومع أن هذا النوع لا يُرجى شفاؤه، إلا أنّ العلاج يضعه في حالة سكون لفترة طويلة، ويتضمّن العلاج الكيماوي والحيوي، وفي بعض الأحيان التدخّل الجراحي لإزالة الطحال."
                , "فحوصات الدم: فحص تعداد الدم الكامل (CBC)، وفحص وظائف الكلى، وفحص وظائف الكبد، وفحص تحديد مستوى حامض اليوريك. كما أن فحص مسحة الدم تحت المجهر ضروريّ للبحث عن أي خلايا سرطانية.\n" +
                "خزعة نخاع العظم هي أكثر الفحوصات شيوعا لتحديد نوع سرطان الدم.\n" +
                "البزل القطني (Spinal Tap) للبحث عن خلايا سرطانية في السائل الشوكي (Cerebrospinal Fluid) وهو السائل الذي يملأ الفراغات داخل وحول الدماغ والحبل الشوكي.\n" +
                "فحص الوراثيات الخلوية (Cytogenic Analysis) حيث ينظر المختبر إلى الكروموسومات في الخلايا من عيّنات الدم أو نخاع العظم أو الغدد الليمفاوية لتحديد ما إذا كانت هناك أيّ مشاكل وراثيّة. على سبيل المثال، فإن الأشخاص الذين يعانون من سرطان الدم النقياني المزمن لديهم كروموسوم غير طبيعي يسمّى كروموسوم فيلادلفيا.\n" +
                "التشخيص الجزيئي (فحوصاتPCR  وFISH). يتمكّن فحص تفاعل البلمرة المتسلسل (PCR) من الكشف عن آثار الخلايا السرطانية في الجسم، بينما يعمل فحص \"مضان التهجين في الموقع\" (FISH) بالكشف عن أيّ عيوب في الكروموسومات في الحمض النووي للخلية."
                , ""));
        mList.add(new ItemsTypes("سرطان الرئة"
                , "سرطان الرئة هو السرطان الذي ينشأ في الرئة، وهو عادة ما يصيب الأشخاص فوق سن 45 عاما، ومن النادر أن يصيب الأصغر سنا."
                , "سرطان الرئة صغير الخلايا، وهو سريع النمو والانتشار، وعادة ما يبدأ في الشعب الهوائية (أنسجة الرئة التي يدخل الهواء من خلالها) ويمكن أن ينتشر بسرعة لأعضاء أخرى في الجسم. ويعتبر التدخين المسبب الرئيسي لهذا النوع من المرض، حيث أنه نادرا ما يصيب غير المدخنين.\n" +
                "سرطان الرئة غير صغير الخلايا، وهو أكثر شيوعا. وهناك عدة أنواع من سرطان الرئة غير صغير الخلايا، وكل نوع يتميز بنوع مختلف من الخلايا السرطانية التي تنمو وتنتشر بطرق مختلفة.\n" +
                "إن الكشف المبكر وملاحظة أعراض سرطان الرئة ضروريان لزيادة فرص النجاة.\n" +
                "\n" +
                "\n" +
                "أسباب سرطان الرئة\n" +
                "\n" +
                "يعتبر التدخين السبب الرئيسي للإصابة بسرطان الرئة. فإذا كنت مدخنا،لا تتأخر في الإقلاع عن التدخين لحماية نفسك ومن حولك.\n" +
                "\n" +
                "عوامل أخرى تتضمن:\n" +
                "\n" +
                "التعرض للتدخين السلبي.\n" +
                "التعرض الكثير للإسبست وغاز الرادون.\n" +
                "التعرض الكبير للإشعاع.\n" +
                "تلوث الهواء الشديد.\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان الرئة، إلا أنها قد تزيد من فرص الإصابة."
                , "سعال مستمر لعدة أسابيع.\n" +
                "ألم في الصدر.\n" +
                "سعال مصحوب بالدم أو بلغم ملطخ بالدماء.\n" +
                "ضيق في النفس.\n" +
                "صفير في الصدر.\n" +
                "صرير مما يدل على انسداد الشعب الهوائية.\n" +
                "خشونة في الصوت.\n" +
                "فقدان وزن غير مفسر.\n" +
                "ألم في العظام وحمّى."
                , "يتم وضع خطة العلاج بناء على حجم الورم ومرحلة المرض، وقد تتضمن الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي، والعلاج الضوئي."
                , "التصوير المقطعي/التصوير المقطعي بالإصدار البوزيتروني.\n" +
                "التنظير الشعبي بالأمواج فوق الصوتية (Endobronchial ultrasound -EBUS)) للحصول على صور للرئتين والمناطق المحيطة، كما يمكن استخدام هذه التقنية للحصول على خزعة من نسيج الرئة.\n" +
                "صور رنين مغناطيسي للدماغ والعظام عند الحاجة.\n" +
                "اختبارات وظائف الرئة (PFT) لمراقبة التنفس وتقييم عمل الرئتين.\n" +
                "فحص خلوي للبلغم، وهو فحص مجهري لخلايا عينة من المادة المخاطية للرئة.\n" +
                "تنظير القصبة الهوائية لفحص المجاري الهوائية للرئتين.\n" +
                "الشفط بالإبرة عبر الصدر للحصول على عينة من نسيج الرئة لفحصه تحت المجهر.", ""));
        mList.add(new ItemsTypes("ورم الظهارة المتوسطة"
                , "ورم الظهارة المتوسطة هو نوع نادر من السرطان يصيب طبقة البطانة في العديد من تجاويف الجسم مثل الرئتين والصدر والبطن."
                , "عامل الخطورة الرئيسي للإصابة بورم الظهارة المتوسطة هو التعرض السابق للإسبست، وهي جزيئات صغيرة يتم استخدامها للعزل وتدفئة المنازل.\n" +
                "\n" +
                "وقد أصبح استخدام هذه المادة محدودا في الوقت الحاضر، وأصبح هناك توجيهات سلامة صارمة في حال التعامل مع هذه المادة أو حولها. مع هذا، فإن التأثيرات السلبيّة لمادة الإسبست لم تكن معروفة في العقود الماضية عندما كان استخدامها أكثر انتشارا، لذا فإن الأشخاص الأكبر سنا الذين تعرضوا للإسبست في سن صغير تكون لديهم فرصة أكبر للإصابة بالمرض.\n" +
                "\n" +
                "وقد تأخذ السرطانات المرتبطة بالإسبست عقودا من الزمن للتطور والظهور، لذا، فلو كنت قد تعرضت للإسبست قبل أكثر من 20 عاما، فقد تكون ما زلت في خطر الإصابة بورم الظهارة المتوسطة.\n" +
                "كما أثبتت الدراسات أن التدخين قد يزيد من فرصة الإصابة بالسرطانات المرتبطة بمادة الإسبست."
                , "تجمع السوائل في الرئتين أو البطن.\n" +
                "صعوبة في التنفس.\n" +
                "ألم في الصدر.\n" +
                "ألم أو تورم في البطن.\n" +
                "وجود كتلة في البطن."
                , "يتم وضع خطة العلاج بناء على حجم الورم ومرحلة المرض. وقد تتضمن الخطة العلاجية الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي. \n" +
                "\n"
                , "التصوير المقطعي/التصوير المقطعي بالإصدار البوزيتروني للتعرف على أي خلل في وظائف الأعضاء أو الأنسجة.\n" +
                "التنظير الشعبي بالأمواج فوق الصوتية Endobronchial ultrasound -EBUS)) للحصول على صور للرئتين والمناطق المحيطة للكشف عن وجود أي أورام، كما يمكن استخدام هذه التقنية للحصول على خزعة من نسيج الرئة.\n" +
                "اختبارات وظائف الرئة (PFT) لمراقبة التنفس وتقييم عمل الرئتين.\n" +
                "فحص خلوي للبلغم، وهو فحص مجهري لخلايا عينة من المادة المخاطية للرئة.\n" +
                "تنظير القصبة الهوائية لفحص المجاري الهوائية للرئتين.\n" +
                "الشفط بالإبرة عبر الصدر للحصول على عينة من نسيج الرئة لفحصه تحت المجهر.\n" +
                "فحوصات الدم (CBC).", ""));
        mList.add(new ItemsTypes("سرطان العين"
                , "هو السرطان الذي ينشأ في العين أو في الأنسجة المحيطة للعين. وهناك عدّة أنواع لسرطان العين:\n" +
                "\n" +
                "الميلانوما العينية: عندما ينشأ السرطان في خلايا العين التي تحتوي على الصبغات مثل القزحية. وهو النوع الأكثر شيوعا بين الكبار.\n" +
                "سرطان أرومة الشبكية: وهو نوع نادر من سرطان العين الذي غالبا ما يصيب الأطفال دون سن الخامسة.\n" +
                "سرطان الغدد الليمفاوية: وهو السرطان الذي يبدأ في خلايا الجهاز المناعي.\n" +
                "سرطان جلد العين: وهو السرطان الذي ينشأ في النسيج الذي يغطي أجزاء العين مثل الجفن.\n" +
                "السرطان المتنقل/المنتشر: هو السرطان الذي ينتقل إلى العين من أعضاء أخرى."
                , "لم يحدد السبب الرئيسي للإصابة بسرطان العين. ولكن، كغيره من أنواع الميلانوما (سرطان الجلد)، يعتقد أن التعرض لمستويات عالية من أشعة الشمس و/أو الأشعة فوق البنفسجية قد تزيد من خطورة الإصابة بالميلانوما العينية. والأشخاص ذوي البشرة الفاتحة أو الجلد الحساس هم أكثر عرضة للإصابة. ومع هذا، فلم يثبت وجود علاقة مباشرة بين التعرض للأشعة فوق البنفسجية وتطور الميلانوما في العين.\n" +
                "\n" +
                "\n" +
                "كما أن الأشخاص الذين لديهم العديد من الشامات ذات الحجم والشكل غير الطبيعيين قد يكونون أكثر عرضة للإصابة بالميلانوما العينية. بالإضافة إلى أن التقدم في السن قد يزيد من فرصة نشوء الأورام في العين.\n" +
                "\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بالميلانوما العينية."
                , "عدم وضوح الرؤية.\n" +
                "وجود بقعة غامقة على القزحية.\n" +
                "ألم في العين.\n" +
                "تغير في شكل البؤبؤ.\n" +
                "غالبا لا يكون هناك أي أعراض ملحّة، إلا أن طبيب العيون يمكن أن يلاحظ وجود أعراض غير طبيعية قبل أن يلاحظها الشخص، لذا ننصح بفحص العيون بشكل منتظم."
                , "يعتمد العلاج الذي سيتلقاه المريض بسرطان العين على عدة عوامل، منها حجم الورم وموقعه ومدى انتشاره، بالإضافة إلى عمر المريض وحالته الصحية العامة.\n" +
                "\n" +
                "وعادة ما يستخدم الأطباء الجراحة والعلاج الإشعاعي كخيارات للعلاج، بالتزامن مع العلاج الإشعاعي الموضعي (Plaque Therapy) للتخلص من الورم والمحافظة قدر الإمكان على العين وقدرة الإبصار.\n" +
                "\n"
                , "فحص العين بالبؤبؤ المتوسع: يتم فحص العين بعد توسيع البؤبؤ باستخدام قطرات طبية، ليتمكن الطبيب من النظر من خلال العدسة والبؤبؤ إلى الشبكية.\n" +
                "تنظير العين (Opthalmoscopy) لفحصها من الداخل.\n" +
                "فحص العين بالأمواج فوق الصوتية.\n" +
                "التصوير المقطعي/التصوير المقطعي بالإصدار البوزتروني (CT/PET scan).\n" +
                "أخذ خزعة.\n" +
                "صور الرنين المغناطيسي.", ""));
        mList.add(new ItemsTypes("سرطان الغدة الزعترية / ورم غدة التوتة"
                , "سرطان الغدة الزعترية والورم التوتي هما نوعان من الأورام التي تصيب الغدة الزعترية (غدة التوتة)، وهي غدة صغيرة موجودة في أعلى الصدر تنتج نوعا من كريات الدم البيضاء التي تعمل على محاربة العدوى. وتعتبر الغدة الزعترية جزءا من النظام الليمفاوي."
                , ""
                , "لا يُظهر هذا النوع من السرطان عادة أي أعراض، ويمكن الكشف عنه من خلال الفحوصات الطبية الروتينية. قد تتضمن الأعراض ما يلي:\n" +
                "\n" +
                "ألم في الصدر.\n" +
                "صعوبة في التنفس.\n" +
                ".سعال مستمر لا يتحسن\n" +
                ".تدلّي الجفون (Ptosis)"
                , "تعالج الحالات في المراحل المبكرة عادة بالجراحة والعلاج الإشعاعي. وقد يتم استخدام العلاج الكيماوي، ولكن هذا يعتمد على مرحلة المرض.  \n" +
                "\n"
                , "صور الأشعة السينية لتحديد موقع وحجم الورم.\n" +
                "التصوير المقطعي/والتصوير المقطعي بالإصدار البوزيتروني للتعرف على أي خلل في وظائف الأعضاء أو الأنسجة.\n" +
                "التنظير الشعبي بالأمواج فوق الصوتية Endobronchial ultrasound -EBUS)) للحصول على صور للرئتين والمناطق المحيطة للكشف عن وجود أي أورام، كما يمكن استخدام هذه التقنية للحصول على خزعة من نسيج الرئة.\n" +
                "اختبارات وظائف الرئة (PFT) لمراقبة التنفس وتقييم عمل الرئتين.\n" +
                "أخذ خزعة من نسيج الورم لفحصه تحت المجهر.\n" +
                "صور الرنين المغناطيسي.\n", ""));
        mList.add(new ItemsTypes("سرطان الغدد اللعابية"
                , "سرطان الغدد اللعابية هو أحد أنواع سرطانات الرأس والرقبة الذي يصيب الغدد التي تنتج اللعاب، وهي موجودة في قاعدة الفم قرب عظم الفك."
                , "التعرض للإشعاع في منطقة الرأس والرقبة سواء للحالات السرطانية أو غير السرطانية.\n" +
                "الإصابة بفيروس أبشتاين-بار (Eppstein-Barr virus-EBV).\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان الغدد اللعابية."
                , "ألم غير عادي في الوجه أو الذقن أو الرقبة.\n" +
                "ورم أسفل الذقن أو حول الفك.\n" +
                "خدران في عضلات الوجه.\n" +
                "صعوبة في البلع."
                , "يعتمد العلاج على عدة عوامل، منها عمر المريض ومرحلة المرض بالإضافة إلى حجم الورم، ولكنه غالبا ما يتضمن درجات متفاوتة من الجراحة، والعلاج الإشعاعي، والعلاج الكيماوي.\n" +
                "\n" +
                "\n" +
                "استعادة الصوت الأساسي: تؤدي بعض الإجراءات العلاجية لسرطانات الرأس والرقبة إلى فقدان المرضى لصوتهم بشكل مؤقت، ما عدا المرضى الذين يتعرضون لاستئصال كامل للحنجرة، حيث يفقد أغلبيتهم صوتهم بشكل دائم. ولكن أطباء الرأس والرقبة هم الأفضل في المنطقة في تطبيق إجراء يعرف باستعادة الصوت الأساسي (Primary Voice Restoration) حيث يستعيد حوالي 90% من المرضى صوتهم بنجاح.  "
                , "صورة الرنين المغناطيسي (MRI) للرأس والرقبة.\n" +
                "التصوير المقطعي بالإصدار البوزيتروني (PET scan).\n" +
                "التصوير المقطعي (CT scan) للحصول على صورة كاملة للرأس والرقبة.\n" +
                "أخذ خزعة من نسيج أو سائل الفم وفحصها جيدا تحت المجهر.\n" +
                "صورة أشعة سينية للصدر للبحث عن أي انتشار للورم إلى الرئتين.\n" +
                "صور أشعة سينية للرأس والرقبة.", ""));
        mList.add(new ItemsTypes("سرطان الغدة الدرقية"
                , "سرطان الغدة الدرقية هو السرطان الذي ينشأ الغدة الموجودة في الرقبة التي تتحكم بضغط الدم، ومعدل نبضات القلب، ودرجة حرارة الجسم، والوزن، وغيرها من الوظائف الحيوية. ويعتبر سرطان الغدة الدرقية من السرطانات القابلة للشفاء ويتسبب بعدد قليل من الوفيات."
                , "التعرض للعلاج الإشعاعي لأنواع أخرى من السرطان وخاصة في منطقة الرأس والرقبة.\n" +
                "تغير في الجين المعدل (RET Gene) من أحد الأبوين إلى الأبناء. ويعتبر كل من يحملون هذا الجين المعدل تقريبا عرضة للإصابة بسرطان الغدة الدرقية اللبي (Medullary Thyroid Cancer)، ويمكن للأشخاص إجراء فحص دم للكشف عن وجود هذا الجين المعدل.\n" +
                "نقص اليود في الغذاء، حيث تحتاج الغدة الدرقية إلى اليود لإنتاج هرمون الدرقية، ولا تعتبر هذه مشكلة في الدول المتطورة التي تضيف اليود إلى ملح الطعام لوقاية الناس من مشاكل الغدة الدرقية.\n" +
                "الأنوثة، حيث وجد أن احتمال إصابة النساء في متوسط العمر بسرطان الغدة الدرقية ضعفي أو ثلاثة أضعاف احتمال إصابة الرجال.\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان الغدة الدرقية."
                , "ظهور كتلة في مقدمة الرقبة.\n" +
                "تغير في الصوت كالخشونة، أو صعوبة بالكلام.\n" +
                "ألم في الرقبة.\n" +
                "صعوبة في البلع."
                , "يتم دمج الرعاية الشمولية لفريق متعدد التخصصات مع خبرة قسم الطب النووي في العلاج باليود المشع."
                , "فحوصات الدم للكشف عن أي مستويات غير طبيعية لهرمون محفّز الدرقية (TSH).\n" +
                "أخذ خزعة من نسيج الغدة الدرقية وفحصها تحت المجهر.\n" +
                "صور الأمواج فوق الصوتية.\n" +
                "المسح الإشعاعي للغدة.", ""));
        mList.add(new ItemsTypes("سرطان القولون والمستقيم"
                , "هو سرطان ينشأ في الأمعاء الغليظة المعروفة أيضا بالقولون أو المستقيم، وعادة يصيب الأشخاص في منتصف العمر. وبالرغم من أنه سرطان يمكن الوقاية منه إلى حد كبير. "
                , "النظام الغذائي الغني باللحوم الحمراء واللحوم المصنّعة.\n" +
                "وجود اللحميات (Polyps) وهي زوائد تنمو على الجدار الداخلي للأمعاء الغليظة عادة لدى الأشخاص فوق سن 50 عاما. ومع مرور الوقت، إذا لم تتم إزالة هذه اللحميات فإنها قد تصبح سرطانية وتنتشر لمناطق أخرى في الجسم.\n" +
                "وجود تاريخ عائلي للإصابة بسرطان القولون والمستقيم.\n" +
                "وجود تاريخ شخصي للإصابة بالسرطان."
                , "الإمساك أو الإسهال.\n" +
                "الشعور بأنّ الأمعاء لا تفرغ بالكامل.\n" +
                "وجود الدم في البراز.\n" +
                "غائط أقلّ كثافة من المعتاد.\n" +
                "آلام متكرّرة تسبّبها الغازات أو الانتفاخ أو الشعور بالامتلاء.\n" +
                "خسارة الوزن دون سبب.\n" +
                "الإرهاق المتواصل.\n" +
                "التقيؤ والغثيان."
                , "يمكن أن يتضمّن علاج سرطان القولون الجراحة، والعلاج الكيماوي، والعلاج الإشعاعي، وعلاج الأضداد وحيدة النسيلة، ورعاية ما بعد العلاج. وتعتبر الجراحة غير فعّالة للمرضى في المراحل المتقّدمة من سرطان القولون والذي قد انتشر، في هذه الحالة يلجأ الأطباء إلى الرعاية التلطيفيّة.\n" +
                "\n"
                , "فحص الدم الخفي في البراز.\n" +
                "الفحوصات الرقميّة للمستقيم.\n" +
                "تنظير القولون السيني لفحص القولون والمستقيم.\n" +
                "أما المرضى المصابون بسرطان القولون، أو توجد شكوك للإصابة به، فهناك تقنيات تشخيصية للكشف عن السرطان وتشمل:\n" +
                "حقنة الباريوم الشرجية للمغايرة المزدوجة (صورة أشعة سينية خاصة للأمعاء).\n" +
                "تنظير القولون لدراسة الورم بدقّة.\n" +
                "صورة رنين مغناطيسي أو صورة الأمواج فوق الصوتيّة للمستقيم.\n" +
                "تصوير مقطعي للصدر والبطن والحوض للكشف عن انتشار السرطان.\n" +
                "المستضد السرطاني المضغي (Carcino-embryonic antigen-CEA) وهو فحص دم مهم يعمل كمؤشر للمرض. ويجب أن تنخفض هذه المؤشرات مع العلاج الكيماوي الفعّال."
                , ""));
        mList.add(new ItemsTypes("سرطان القناة الصفراوية"
                , "سرطان القناة الصفراوية ينشأ في الأنابيب التي تحمل المادة الصفراوية (سائل ينتجه الكبد لهضم الدهون) بين الكبد والمرارة والأمعاء."
                , "التهاب مزمن في القناة الصفراوية مثل الحصوات المزمنة في القناة الصفراوية المشتركة، ووجود المثقوبة الكبدية (Hepatic Flukes).\n" +
                "أمراض كبد محدّدة مثل التهاب الكبد الوبائي نوع (C).\n" +
                "التهاب مزمن للقولون يؤدي إلى ظهور تقرحات في الجدار."
                , "نقصان في الوزن.\n" +
                "اليرقان (اصفرار في الجلد والعينين).\n" +
                "الحمّى.\n" +
                "الألم في البطن."
                , "يتم تحديد العلاج حسب مرحلة المرض وقد يتضمّن الجراحة، والعلاج الكيماوي و / أو العلاج الإشعاعي.\n" +
                "\n"
                , "فحوصات الدم.\n" +
                "فحص وظائف الكبد.\n" +
                "اختبار (Endoscopic Retrograde Cholangiopancreatography-ERCP) لفحص وتشخيص أمراض الكبد والقناة الصفراوية والبنكرياس، ويمكن أخذ خزعة في نفس الوقت.\n" +
                "أخذ خزعة بالمنظار للحصول على عيّنات النسيج لإجراء المزيد من الاختبارات.\n" +
                "فحص الأمواج فوق الصوتية عبر المنظار للحصول على تقييم أكثر دقّة للورم.\n" +
                "تصوير مقطعي للصدر والبطن والحوض لتحديد ما إذا كان المرض قد انتشر لمناطق أخرى في الجسم.\n" +
                "تصوير القناة الصفراوية بالرنين المغناطيسي (Magnetic Resonance Cholangiography-MRCP) وهي عبارة عن تقنيّة تشخيصية لاستعراض القنوات الصفراوية والبنكرياس.\n" +
                "تركيب دعامات معدنية أو بلاستيكية لتخفيف اليرقان.", ""));
        mList.add(new ItemsTypes("سرطان الكلى"
                , "هو ورم ينشأ في الكلية، حيث يعد سرطان الخلايا الكلوية أكثر أنواع سرطان الكلى شيوعا، ويتكون في أنابيب صغيرة جدا في بطانة الكلية والتي تقوم بتنقية الدم. وإذا ما تم تشخيص المرض في مرحلة مبكرة فإن فرصة الشفاء تكون عالية. ومن أنواعه سرطان الحوض الكلوي: ينمو في في مركز الكلية حيث يتجمع البول، وهو نوع نادر من أنواع سرطان الكلية."
                , "التدخين.\n" +
                "التعرض لبعض الكيماويات كتلك المستخدمة في صناعة الفولاذ والفحم أو الصناعات الهندسية.\n" +
                "الإصابة بأمراض الكلية، خاصة التي تتطلّب غسيل الكلى.\n" +
                "الاستعداد الوراثي، هناك حالات نادرة عندما يتم توارث بعض الجينات التي تزيد فرص الإصابة بسرطان الكلية. وإذا كان هناك اثنين أو أكثر من نفس العائلة أصيبوا بسرطان الكلية، فقد يكون لدى باقي أفراد العائلة احتمالية أكبر للإصابة بسرطان الكلية.\n" +
                "إن وجود واحد أو أكثر من هذه العوامل لا يعني بالضّرورة إصابة الشخص بسرطان الكلية."
                , "وجود دم في البول.\n" +
                "ألم في الخاصرة.\n" +
                "كتلة ملموسة في الخاصرة أو البطن.\n" +
                "فقدان وزن غير مفسر.\n" +
                "الحمّى.\n" +
                "ارتفاع ضغط الدم.\n" +
                "فرط كالسيوم الدم.\n" +
                "تعرق ليلي."
                , "إن فرص التعافي للمرضى في المراحل المبكرة من المرض تكون كبيرة، حيث أن النهج العلاجي المتبع لهؤلاء المرضى غالبا ما يكون شافيا، أي يتم القضاء على الورم ومنعه من العودة. أما في المراحل المتقدمة من المرض، فيعتمد العلاج على مدى الانتشار.  \n" +
                "\n" +
                "\n" +
                "الجراحة\n" +
                "\n" +
                " يوجد أكثر من نمط لعلاج سرطان الكلى ولكل نمط من هذه الأنماط مميزات، ويتم تحديد نمط العلاج المناسب لكل مريض بناء على قرار العيادة المشتركة متعددة الاختصاصات، حيث تتم مناقشة الحالة وطرح جميع الخيارات الممكنة والتي تناسب المريض بناء على وضعه الصحي العام وذلك لأن لكل مريض خصوصية من حيث التعامل معه كحالة مرضية تستدعي الوقوف عندها لعدم حدوث مضاعفات أثناء وبعد فترة العلاج.\n" +
                "\n" +
                "\n" +
                "الجراحة هي عميلة إزالة أو إصلاح جزء من الجسم، تعتبرالجراحة العلاج الرئيسي الذي يناسب معظم سرطانات الكلى، والهدف من الجراحة إزلة كامل الورم من الجسم ولذلك قد يحتاج الجراح خلال العملية لاستئصال جزء أو كامل الكلى وأجزاء من الأنسجة القريبة وتنظيف العقد اللمفاوية المحيطة، كل هذا يعتمد على حجم الورم وموقعه ومدى انتشاره وإمكانية استئصاله. وتعتبر الجراحة الطريقة الوحيدة والفعالة المتفق عليها، لذلك يوجد أكثر من شكل من أشكال جراحة الكلى:\n" +
                "\n" +
                " الاستصال الجزئي للكلى: وهي عملية استئصال فقط جزء من الكلى مع كامل الورم وأجزاء من الأنسجة القريبة وتبقى الكلى تعمل بشكل فعال. وتعتبر هذه العملية الأفضل للمرضى خاصة الذين يعانون من مشاكل في وظائف الكلى أو ممن يملكون كلى واحدة فقط أو في حال وجود ورم في كلتا الكليتين ويلزم عمل الجراحة في الجهتين.\n" +
                "\n" +
                "عملية الاستئصال الجذري(Radical)  للكلى تحتاج إلى خبرة عالية من الجراح لاستصال كامل الورم مع أصغر جزء من الكلى، وعلى الجراح أن يكون حذراً في تحديد موقع الشق الجراحي وحجمه، بالإضافة إلى القدرة على عدم العبث في الورم نفسه والحفاظ على الجزء السليم من الكلى بحالته الجيدة للقيام بوظائفه. وقد يحتاح الجراح أثناء العملية إلى استئصال كامل الكلى وذلك بناء على تقييم حجم الورم وموقعه.\n" +
                "\n" +
                "\n" +
                "تتم عملية الاستصال الجزئي للكلى للكلى بطريقتين:\n" +
                "\n" +
                "شق البطن: حيث يقوم الجراح بعمل شق من خلال طبقات الجلد والطبقات الدهنية والعضلات والأغشية التي تحمي الكلى حتى الوصول إلى الكلى.\n" +
                "الاستئصال عن طريق المنظار: حيث يقوم الجراح بعمل شقوق صغيرة ليتمكن من إدخال منظار البطن وأدوات الجراحة المناسبة وشق صغير لإخراج الجزء المستأصل من الكلى مع الورم، الجراحة عن طريق المنظار قد تحتاج إلى وقت ضعف الوقت المراد في جراحة شق البطن.\n" +
                "\n" +
                "استئصال الكلية الجذري: هي عملية جراحية لاستئصال كامل الكلى والورم والعقد اللمفاوية المحيطة والأنسجة الدهنية القريبة واحتمالية استئصال الغدة الكظرية وتعتمد كمية الأنسجة المحيطة التي يتم استئصالها على حجم الورم وموقع الورم وامتداد الورم.\n" +
                "\n" +
                "يعتبر استئصال الكلية الجذري العلاج جذري والمعياري لسرطان الكلى من المرحلة 2 & 3 والعلاج المفضل في حال امتداد الورم للوريد الأجوف (Vena Cava ).\n" +
                "\n" +
                "\n" +
                "تتم عملية الاستصال الجذري للكلى للكلى بطريقتين:\n" +
                "\n" +
                "شق البطن: حيث يقوم الجراح بعمل شق من خلال طبقات الجلد والطبقات الدهنية والعضلات والأغشية التي تحمي الكلى حتى الوصول إلى الكلى.\n" +
                "الاستئصال عن طريق المنظار: حيث يقوم الجراح بعمل شقوق صغيرة ليتمكن من إدخال منظار البطن وأدوات الجراحة المناسبة وشق صغير لإخراج الجزء المستأصل من الكلى مع الورم، الجراحة عن طريق المنظار قد تحتاج إلى وقت ضعف الوقت المراد في جراحة شق البطن.\n" +
                "\n" +
                "إزالة الكلية مع وجود إنتشار للورم: هي عملية جراحية لاستئصال كامل الكلى والورم واستئصال أكبر كمية من الورم المنتشر ويشترط في هذه العملية أن تكون الصحة العامة للمريض جيدة جداً ويمكنه تحمل تبعات العملية الجراحية. تهدف هذه العملية لاستصال أكبر كمية ممكنة من الورم المتواجدة في الجسم، وتخفيف حدة الورم من أجل الخضوع لنمط علاج آخر مثل العلاج المناعي.\n" +
                "\n" +
                "العلاج المستهدف: وهو نوع من العلاج يستخدم الأدوية وعناصر أخرى مثل الأجسام المضادّة لتحديد ومهاجمة خلايا سرطان محددة.\n" +
                "\n" +
                "العلاج الحيوي: والمعروف أيضا بالعلاج المناعي، ويعمل على تعزيز أو استعادة قدرة الجهاز المناعي على محاربة خلايا السرطان باستخدام الأجسام المضادّة والمطاعيم وعوامل النمو.\n" +
                "\n"
                , "فحص الدم (CBC).\n" +
                "فحص وظائف الكلى.\n" +
                "فحص مستوى الكالسيوم في الدم.\n" +
                "صور الأمواج فوق الصوتية للحصول على صور للكليتين والنسيج المحيط.\n" +
                "التصوير المقطعي.", ""));
        mList.add(new ItemsTypes("سرطان الكبد"
                , "هو السرطان الذي ينشأ في الكبد، المسؤول عن إنتاج الإنزيمات التي تعمل على هضم الطعام بالإضافة إلى إزالة المواد الضارّة من الدم."
                , "الإصابة بعدوى فيروس الكبد الوبائي ب (HBV) أو فيروس الكبد الوبائي سي (HCV).\n" +
                "الإفراط في تناول المشوبات الكحولية أو تناولها لفترة طويلة.\n" +
                "الإصابة بداء الصباغ الدموي (Hemachromatosis) وهي حالة تحدث عندما يكون هناك كمية كبيرة من الحديد مخزّنة في الجسم.\n" +
                "تليّف الكبد (Cirrhosis) وهو عنمرض كبدي خطير يصاب به الشخص نتيجة الإصابة بفيروس الكبد الوبائي (B) أو (C) أو نتيجة التناول المفرط لمشروبات الكحولية. كما أن هناك أسباب أخرى لتليّف الكبد كالتعرّض لأنواع معيّنة من الطفيليّات أو الإصابة بداء الصباغ الدموي.\n" +
                "البدانة.\n" +
                "السكري.\n" +
                "أمراض القولون مثل التهاب القولون التقرّحي."
                , "اليرقان (اصفرار في الجلد أو العينين).\n" +
                "ألم في الجانب العلوي الأيمن من البطن.\n" +
                "انتفاخ أو تورّم في الجزء العلوي من البطن.\n" +
                "بول غامق اللون.\n" +
                "البراز الذي يبدو شاحبا أو يطفو داخل الحمام.\n" +
                "فقدان الشهيّة.\n" +
                "الغثيان.\n" +
                "الإرهاق.\n" +
                "فقدان الوزن دون سبب.\n" +
                "مع هذا، فإنّ معظم هذه المؤشّرات والأعراض لا تظهر في المراحل المبكّرة من المرض، لذا ننصح بإجراء فحوصات الكشف المبكّر بشكل دوري، لتشخيص السرطان في مراحله المبكّرة حيث تكون نسبة الشفاء أعلى."
                , "يقوم الطبيب المعالج بعرض الحالة على فريق العيادات متعدّدة الاختصاصات لتحديد خطة العلاج، حيث يتم استئصال الورم بشكل كامل من خلال الجراحة، بالنسبة للمرضى الذين لا يمكنهم الخضوع للجراحة، فهناك علاجات أخرى يحددها الطبيب.\n" +
                "\n" +
                "وتتضمّن التقنيات الحديثة مهاجمة الورم بالعلاج الكيماوي من خلال الأوعية المغذّية (Chemoembolization)، والاستئصال الموضعي للورم باستخدام مجسّا خاصّا لتدمير الخلايا السرطانية بواسطة الحرارة. "
                , "التصوير المقطعي.\n" +
                "صور الرنين المغناطيسي.\n" +
                "اختبار (Endoscopic retrograde cholangiopancreatography-ERCP) لفحص وتشخيص أمراض الكبد والقناة الصفراوية والبنكرياس.\n" +
                "الخزعة الموجّهة بالصور (إما من خلال الأمواج فوق الصوتيّة أو التصوير المقطعي).\n" +
                "فحص الدم ألفا فيتو بروتين (Alpha fetoprotein).\n" +
                "أخذ خزعة عن طريق المنظار للحصول على عينات من النسيج داخل وحول الكبد لإجراء المزيد من الفحوصات.", ""));
        mList.add(new ItemsTypes("سرطان الليمفوما عدا هودجكن"
                , "الليمفوما هو سرطان يبدأ في خلايا الجهاز المناعي، وتحديدا في خلايا الدم البيضاء المصمّمة لمحاربة العدوى وحماية الجسم من الأمراض. هناك نوعان من الأورام الليمفاوية: مرض هودجكن، والأورام الليمفاوية عدا هودجكن."
                , "تتطوّر الأورام الليمفاوية عدا هودجكن عندما تصبح خلايا الدم البيضاء خلايا تي أو خلايا بي خلايا غير طبيعية. ثم تبدأ هذه الخلايا بالنمو والانقسام منتجة المزيد من الخلايا غير الطبيعية. عندما تزداد أعداد هذه الخلايا، فإنها تبدأ بمنافسة خلايا الدم البيضاء السليمة ومنعها من القيام بوظيفتها التي تتمثّل في حماية الجسم من العدوى والأمراض.\n" +
                "\n" +
                "لم يُعرف سبب الأورام الليمفاوية، لكن هناك عوامل يمكن أن تزيد من احتمالية تطور الأورام الليمفاوية عدا هودجكن، منها:\n" +
                "\n" +
                "الإصابة بعدوى فيروس ابشتاين بار (EBV)، وهي عدوى فيروسية شائعة تسبّب مرض يسمى (Mononucleosis).\n" +
                "الإصابة بفيروس نقص المناعة البشريّة (HIV) المسبب لمرض الإيدز.\n" +
                "الإصابة بفيروس الكبد الوبائي نوع (C).\n" +
                "ضعف الجهاز المناعي."
                , "وجود كتل غير مؤلمة (غدد ليمفاوية متضخّمة) تحت الجلد هو أكثر الأعراض شيوعا، هذه الكتل قد يتغيّر حجمها\n" +
                "الضعف والإرهاق\n" +
                "الحمّى\n" +
                "التعرّق الّليلي\n" +
                "السعال المستمر\n" +
                "الآلام في الصدر"
                , "يتم التعامل مع كل حالة على حِدة، حيث يقوم الطبيب المعالج بعرض الحالة على فريق العيادات متعدّدة الاختصاصات، وتتم دراسة عيّنات الأنسجة ونتائج الأشعّة بعناية شديدة، للوصول إلى خطّة علاج شاملة لحالة المريض."
                , "أخذ خزعة للحصول على تشخيص صحيح وتحديد نوع المرض الفرعي.\n" +
                "صورة أشعّة سينية للصدر.\n" +
                "تصوير مقطعي للمناطق المصابة والأعضاء الداخلية للكشف عن مدى انتشار المرض خاصة في الصدر والبطن.\n" +
                "تصوير مقطعي بالإصدار البوزيتروني (PET scan)، الذي يعمل على دمج صور التصوير المقطعي (CTScan) والتصوير المقطعي بالإصدار البوزيتروني (PET scan) للحصول على درجة أعلى من الدّقة.\n" +
                "خزعة نخاع العظم.\n" +
                "فحص تعداد الدم الكامل (CBC) للبحث عن وجود فقر دم أو تعداد منخفض للخلايا البيضاء أو الصفائح في حالات إصابة نخاع العظم.\n" +
                "فحوص دم أخرى بما فيها فحص سرعة الترسيب في الدم (ESR)، وفحوصات وظائف الكلى والكبد.", ""));
        mList.add(new ItemsTypes("سرطان المثانة"
                , "سرطان المثانة هو السرطان الذي ينشأ في بطانة المثانة وغالبا ما يصيب كبار السنّ، والرجال أكثر عرضة للإصابة به من النساء."
                , "التدخين.\n" +
                "التعرض إلى المواد الكيماوية التي تستخدم في بعض الصناعات كالصبغات والدهانات.\n" +
                "التهابات المثانة المزمنة مثل التهابات المثانة المتكررة ومشاكل الجهاز البولي.\n" +
                "إنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان المثانة."
                , "وجود دم في البول.\n" +
                "الشعور بحرقة أو ألم عند التبوّل.\n" +
                "التبوّل بشكل متكرر."
                , "العمليات الجراحية:\n" +
                "\n" +
                " \n" +
                "\n" +
                "واحد من الأنواع التالية من العمليات جراحية يمكن القيام به:\n" +
                "\n" +
                "كشط الورم عبر الإحليل (TURBT): جراحة تتم بإدخال منظار المثانة (أنبوب مضاءة رقيقة) في المثانة عن طريق مجرى البول حيث يتم استخدام أداة مع حلقة صغيرة من السلك على نهايته لإزالة السرطان أو لحرق الورم بعيدا مع الكهرباء ذات الطاقة العالية. وهذا ما يعرف بالصعق(الكي الكهربائي). و هو العلاج المتبع في العادة لسرطان المثانة السطحي\n" +
                "يؤثر حجم الورم وعدوانية استئصاله على مدة الرعاية ما بعد الجراحة وخطر حدوث مضاعفات بعد استئصال ورم المثانة عبر الإحليل من (TURBT).\n" +
                "\n" +
                "\n" +
                "غالبية المرضى الذين لديهم استئصال ورم سطحي صغير يمكن تصريفها بدون قسطرة في يوم العملية الجراحية والمريض الذي يخضع لاستئصال حجم أكبر من الورم وصولا إلى الدهون حول المثانة. قد يتطلب ذلك 24 إلى 48 ساعة من دخول المستشفى مع بقاء القسطرة البولية في المثانة لمدة 4 إلى 7 أيام. أكثر المضاعفات شيوعا للـ TURBT هو النزيف الذي يتطلب متابعة مستمرة لأول 48 ساعة لعدم حدوث تجلط وتكتل للدم مما يؤدي لانسداد مجرى البول.\n" +
                "\n" +
                "استئصال المثانة الجذري (Radical Cystectomy): جراحة لإزالة المثانة والغدد الليمفاوية أي والأعضاء المجاورة التي تحتوي على السرطان. ويمكن أن يتم هذه الجراحة عندما يمتد سرطان المثانة في الجدار العضلي، أو عندما ينطوي سرطان سطحي جزء كبير من المثانة. في الرجال الأعضاء المجاورة التي تتم إزالتها هي البروستاتا والحويصلات المنوية. أما في النساء يتم إزالة الرحم، المبيض، وجزء من المهبل.\n" +
                "تحويل مجرى البول: جراحة مبتكرة جديدة لتحويل مجرى البول بعد عملية الاستئصال الجذري للمثانة حيث يتم إنشاء فتحة عن طريق جدار البطن لتمرير البول من خلالها، أو صنع مثانة اصطناعية من الأمعاء الدقيقة.\n" +
                "استئصال المثانة عادة ما يتطلب البقاء في المستشفى لمدة أسبوع تقريبا. والشفاء الكامل عادة ما يستغرق 6-8 أسابيع.\n" +
                "\n" +
                "قد تكون هناك حاجة إلى المزيد من العلاج بعد استئصال المثانة الجذري ويمكن أن يشمل العلاج الإشعاعي أو العلاج الكيماوي.\n" +
                "\n" +
                "\n" +
                "استئصال المثانة الجزئي (Partial Cystectomy):\n" +
                "هي جراحة لإزالة جزء من المثانة. ويمكن أن تتم هذه الجراحة للمرضى الذين لديهم ورما منخفض الدرجة الذي امتد حتى جدار المثانة ولكن يقتصر على منطقة واحدة من المثانة فقط لأن جزء من المثانة يمكن استئصاله، ولا تتم إلا في حالات محددة وضمن شروط لا تنطبق على معظم المرضى، ويبقى المريض قادراً على التبول بشكل طبيعي بعد تعافيه من هذه الجراحة. وهذا ما يسمى أيضا استئصال المثانة القطعي."
                , "تحليل البول.\n" +
                "دراسة خلوية للبول (Urine cytology): وهو اختبار متخصص لفحص خلايا بطانة المثانة (التي تطرح مع البول) تحت المجهر للبحث عن وجود أي خلايا سرطانية.\n" +
                "تنظير المثانة.\n" +
                "أخذ خزعة من بطانة المثانة.\n" +
                "التصوير المقطعي للبطن والحوض.\n" +
                "فحوصات أخرى لفحص انتشار الورم مثل مسح العظام وصورة أشعة سينية للصدر والتصوير المقطعي.", ""));
        mList.add(new ItemsTypes("سرطان المعدة"
                , "سرطان المعدة هو السرطان الذي يبدأ في المعدة وقد ينمو خلال جدار المعدة ويصل إلى المريء والأمعاء الدقيقة."
                , "النظام الغذائي الغني بالأطعمة المعالجة والمدخّنة والمخلّلة والمملّحة.\n" +
                "الإصابة ببكتيريا (Helicobacter pylori) التي تسبّب التقرّحات والالتهابات في المعدة.\n" +
                "وجود تاريخ عائلي لللإصابة بسرطان المعدة.\n" +
                "التدخين."
                , "قد لا يُظهر سرطان المعدة أيّ أعراض حتى يصل إلى مراحل متقدّمة، لذا ننصح بإجراء فحوصات الكشف المبكّر للكشف عن سرطان المعدة، خاصة إذا تمّ تشخيص أحد الأقارب بالمرض نفسه. وقد تتضمّن الأعراض:\n" +
                "\n" +
                "عسر الهضم.\n" +
                "الغثيان والقيء.\n" +
                "صعوبة البلع.\n" +
                "الشبع بمجرّد البدء بتناول الطعام.\n" +
                "فقدان الشهيّة.\n" +
                "البراز الأسود (Melena) كمؤشّر على وجود نزيف هضمي.\n" +
                "تقيؤ الدم.\n" +
                "فقدان الوزن دون سبب."
                , "غالبا ما تكون الجراحة هي أول خطوة في علاج مرضى سرطان المعدة. وبناء على مرحلة تطور المرض قد يحتاج المرضى إلى العلاج الكيماوي والعلاج الإشعاعي.\n" +
                "\n"
                , "فحص تعداد الدم الكامل (CBC) للبحث عن مؤشّرات فقر الدم الذي قد يحصل بسبب نزيف داخلي.\n" +
                "فحص المستضد السرطاني المضغي (Carcino-embryonic antigen-CEA) أو فحص (CA19-9).\n" +
                "التنظير العلوي.\n" +
                "تنظير بواسطة الأمواج فوق الصوتيّة للحصول على تقييم أدقّ للورم.\n" +
                "التصوير المقطعي أو الرنين المغناطيسي للصدر والبطن والحوض للكشف عن انتشار السرطان.", ""));
        mList.add(new ItemsTypes("سرطان المرارة"
                , "سرطان المرارة هو السرطان الذي ينشأ في المرارة، وهي العضو الذي يخزّن مادة الصفراء (Bile)، وهي عبارة عن سائل يفرزه الكبد لهضم الدهون."
                , "التهاب المرارة طويل الأمد.\n" +
                "الّلحميات (Polyps) التي قد تنمو على الجدار الداخلي للمرارة وتتحول إلى سرطانية.\n" +
                "البدانة."
                , "لأسف، إنّ سرطان المرارة صعب الاكتشاف وعادة لا يُظهر أي أعراض إلا في المراحل المتقدمة من المرض. لذا، ننصحك بالقيام بفحوصات الكشف المبكر للسرطان. وقد تتضمن أعراض سرطان المرارة:\n" +
                "\n" +
                "اليرقان (اصفرار في الجلد والعينين).\n" +
                "الحمّى.\n" +
                "الغثيان والقيء.\n" +
                "ألم فوق المعدة.\n" +
                "الشعور بكتلة داخل البطن."
                , "تكون الجراحة عادة الخيار الأول للعلاج، وبناء على مرحلة السرطان، يحتاج معظم المرضى إلى العلاج الكيماوي والإشعاعي.\n" +
                "\n"
                , "فحص المستضد السرطاني المضغي (Carcino-Embryonic Antigen-CEA) أو فحص (CA19-9) وهما فحصا دم قد تكون نتائجهما مرتفعة عند التشخيص، ويساعدان على متابعة مدى استجابة المريض للعلاج خلال وبعد فترة العلاج.\n" +
                "اختبار (Endoscopic retrograde cholangiopancreatography-ERCP) وهو اجراء يستخدم لفحص وتشخيص أمراض الكبد والقناة الصفراوية والبنكرياس.\n" +
                "أخذ خزعة عن طريق المنظار للحصول على عيّنات من النسيج داخل وحول الكبد لإجراء المزيد من الفحوصات.\n" +
                "تنظير بالأمواج فوق الصوتية للحصول على تقييم أدقّ للورم.\n" +
                "التصوير المقطعي أو الرنين المغناطيسي للصدر والبطن والحوض للبحث عن انتشار السرطان في أماكن أخرى في الجسم.", ""));
        mList.add(new ItemsTypes("سرطان المريء"
                , "هو السرطان الذي يصيب المريء، وهو المجرى الذي ينقل الطعام والشراب من البلعوم إلى المعدة."
                , "التقدّم بالعمر.\n" +
                "نظام تغذية يفتقر إلى العناصر الغذائيّة الأساسية مثل تلك الموجودة في الخضراوات والفاكهة. \n" +
                "التدخين.\n" +
                "الإفراط في شرب الكحول.\n" +
                "الارتداد المعدي، فإذا كان مزمنا قد يدمّر البطانة الداخلية للمريء.\n" +
                "البدانة.\n" +
                "إنّ وجود واحد أو أكثر من هذه العوامل لا يعني بالضرورة إصابة الشخص بسرطان المريء."
                , "صعوبة أو ألم عند البلع.\n" +
                "ألم في الصدر أو الظهر.\n" +
                "بقاء الطعام عالقا في المريء.\n" +
                "حرقة في المعدة.\n" +
                "تغيّر الصوت أو خشونة في الصوت لعدة أسابيع.\n" +
                "سعال مستمر.\n" +
                "فقدان الشهيّة وانخفاض حاد في الوزن."
                , "تكون الجراحة الخيار الأول للمرضى في المراحل المبكّرة من سرطان المريء. وبناء على تطوّر السرطان، يتم تحديد احتياجات المرضى من العلاج الكيماوي والإشعاعي."
                , "فحص الدم.\n" +
                "التنظير. \n" +
                "تنظير بالأمواج فوق الصوتية للحصول على تقييم أدقّ.\n" +
                "خزعة لإزالة عينة نسيج من المريء.\n" +
                "التصوير المقطعي أو الرنين المغناطيسي للصدر والبطن والحوض للبحث عن انتشار السرطان في أماكن أخرى في الجسم.\n" +
                "التصوير المقطعي بالإصدار البوزتروني لكامل الجسم (PET Scan) وهو فحص يستخدم لتقييم مدى انتشار المرض.", ""));
        mList.add(new ItemsTypes("سرطان هودجكين"
                , "مرض هودجكين هو نوع من السرطان ينشأ في خلايا الجهاز المناعي، تحديدا في خلايا الدم البيضاء المصمّمة لمحاربة العدوى وحماية الجسم من الأمراض. وهو من الأمراض السرطانية التي تسمى أمراض الأورام الليمفاوية، والنوع الآخر يسمى الورم الليمفاوي عدا هودجكين. \n" +
                "\n" +
                "يتم تمييز مرض هودجكن حسب وجود نوع من الخلايا يدعى (ريد-ستيرنبيرغ)، وهو نوعان:\n" +
                "\n" +
                "مرض هودجكن الكلاسيكي (Classical Hodgkin lymphoma).\n" +
                "غلبة اللمفاوي العقيدي (Nodular lymphocyte predominant- Hodgkin lymphoma)."
                , "يتطوّر مرض هودجكن عندما يبدأ نوع معيّن من خلايا الدم البيضاء تسمى \"خلايا بي\" بالنمو بشكل غير طبيعي. هذه الخليّة غير الطبيعية تسمّى خليّة (ريد-ستيرنبيرغ)، وهي أكبر بكثير من الخليّة الطبيعية. تبدأ خلايا (ريد-ستيرنبيرغ) بالنمو والانقسام وإنتاج المزيد من الخلايا غير الطبيعية، والتي تعمل بدورها على منع الجهاز المناعي من القيام بوظيفته في حماية الجسم. حيث أن هذه الخلايا غير الطبيعية لا تحارب العدوى مثلما تفعل الخلايا الطبيعية. \n" +
                "\n" +
                "لا يوجد مسببات معروفة لمرض هودجكين، لكن هناك عوامل خطورة قد تزيد من فرص الإصابة به، وهي:\n" +
                "\n" +
                "الإصابة بعدوى فيروس ابشتاين بار (EBV)، وهي عدوى فيروسية شائعة تسبب مرضا يسمّى (Mononucleosis).\n" +
                "الإصابة بفيروس نقص المناعة البشرية (HIV).\n" +
                "ضعف الجهاز المناعي.\n" +
                "التاريخ العائلي (1% من المرضى لديهم تاريخ عائلي بالإصابة).\n" +
                "إنّ وجود واحد أو أكثر من عوامل الخطورة هذه لا يعني بالضرورة إصابة الشخص بمرض هودجكن."
                , "وجود كتلة غير مؤلمة في الرّقبة.\n" +
                "الحمّى.\n" +
                "خسارة الوزن التي لا يعرف سببها.\n" +
                "تعرّق ليلي.\n" +
                "سعال مستمر.\n" +
                "ضيق في التنفّس.\n" +
                "حكّة في الجلد.\n" +
                "آلام في الظهر."
                , "تم التعامل مع كل حالة على حدة، حيث يقوم الطبيب المعالج بعرض الحالة على فريق العيادات متعددة الاختصاصات، وتتمّ دراسة عينات الأنسجة، ونتائج الأشعّة بعناية شديدة، ومناقشة الحالة للوصول إلى خطة علاج شاملة للمريض.\n" +
                "\n" +
                "يحتاج معظم المرضى إلى مزيج من العلاج الكيماوي والإشعاعي، حيث تعتمد كمية العلاج الكيماوي والإشعاعي على مرحلة المرض. وفي حالة مقاومة العلاج (عندما لا يستجيب السرطان للعلاج الموصوف) أو حالة الانتكاس، يخضع المرضى عادة لعملية زراعة نخاع العظم أو الخلايا الجذعية المحيطية وغالبا تكون النتائج جيدة. ولا تعتبر الجراحة خيارا في علاج مرضى هودجكن."
                , "أخذ خزعة وتحديد نوع المرض الفرعي.\n" +
                "تصوير أشعّة سينية للصدر.\n" +
                "تصوير مقطعي للمناطق المصابة والأعضاء الداخلية للكشف عن مدى انتشار المرض خاصّة في الصدر والبطن.\n" +
                "تصوير مقطعي بالإصدار البوزيتروني (PET scan) من خلال جهاز يعمل على دمج صور التصوير المقطعي (CTScan) ، والتصوير المقطعي بالإصدار البوزيتروني (PET scan) للحصول على درجة أعلى من الدّقة.\n" +
                "خزعة نخاع العظم.\n" +
                "فحوصات الدم، بما فيها تحليل سرعة الترسيب في الدم (ESR)، وتعداد الدم الكامل (CBC) وفحوصات وظائف الكبد والكلى.", ""));
    }
}